[{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7b9"
  },
  "id": "qiufen-note",
  "title": "秋分备忘",
  "date": {
    "$date": "2023-09-23T00:00:00.000Z"
  },
  "category": "随笔杂谈",
  "body": "合肥的夏天，喜怒无常。有时阴雨，有时烈阳，但总体上是阴凉的。除却学校门口这片尴尬的工地，周围四处都还是宜人的。\r\n\r\n我的假期实习就是在此进行的。\r\n\r\n从一开始的懵懂，到现在的技术成熟，不得不说，实践令人受益良多。数不清的冷清之时，偌大一个办公室只剩我一人，对着文档发呆。我此时既不为利益驱动，也不为任务驱动，而是为了完成我心中的“蓝图”。\r\n\r\n到了八月中旬，我的“Penyo Portal”基本完工。它是我一直以来所梦想的终极前端设计，也代表着我的前端技术到达了一个新的顶点——正式与商业化、现代化、工程化接轨。虽然也做了一点别的工程，不过那都是前备的练手，似是无必要，而又有必要。就像品茶，没有品过千百种，又怎能择出超群之一？我的牙齿早已染色，茶水腐蚀其稚嫩的白坯，鎏上岁月的金。\r\n\r\n而通过其一，即洞见无穷。\r\n\r\n我闭上眼，感受历史这无形的锉刀。多次回顾已经做过无数遍的事情，在时间的长河里“刻舟求剑”，形变而神不变。此时，我终于开始理解前人抽象事物的智慧，技术已经超越了象限，变成了哲学。\r\n\r\n眼看众皆端坐，眼看众俱喧闹，眼看众纷离去。\r\n\r\n在心流之中，时间开始模糊、空间变得狭隘。我仔细端详着抽象（abstract）与实现（implement）、分解（decouple）与重组（recombine）的艺术，望着屏幕，常常就是半天。\r\n\r\n尽管我的形已潦草，但这已不再重要。越是远离理论，就越是能遗忘形式主义。阶梯式的成功让我有了信心，能够开辟更大的未知。去探索，难以到达的深度或广度。于是我开始了解我也许本来一辈子也不会接触的东西。也许是密码学，也许是图形学，也许是单纯的编译原理，或者说只是嵌入式开发。我感受到，我有太多不知。这不仅是我的不知，亦是人类的不知。我想探索无人之境，而不是为了狭隘的自尊或名利重复造轮子。\r\n\r\n我在做的，也许是一场真正的实验。是没有前人开路的分支；是没有高人指导的分支；是没有人感兴趣的分支。这就像一个甜蜜的捕兽夹，钳住了我，却令我沉迷其中——感受孤独的痛、绝望的痛与野蛮的美。\r\n\r\n我不属于任何组织，也不信任任何团体。我只相信我自己，我只相信我能看到的事实。非偏执狂的机会总是容易被经验主义贻误，而无人所知晓的，只能靠天马行空的开创。\r\n\r\n尽管并不一定能成功，因为**这只是一场实验，一场无人验收的实验**。\r\n\r\n而后是“多灾多难”的开学季。这样说是不无道理的，尤其是要被迫承认自己的平庸与无能，以及人性的弱点。一开始是室友手机坏了，然后他的电脑又坏了......接着没几天我的手机又坏了。我自己想换更新更好的，但是却要仔细思考：花出的每一分钱是否都能铸就更锋利的刀刃。常年的精打细算让我疲惫不堪，“既要又要”背后不是真正的节约，而是抠、变态的抠门。我已经受够了这种贪婪带给我的折磨，但又因为现实条件限制而不得不低头。\r\n\r\n之后是每年一次的评奖学金。当然，又一次的，跟我毫无关系。仔细看去，其他人都不知道从哪找的渠道，疯狂参加各种竞赛，不能说是八仙过海，那也得是神仙打架。这综测分加的是噌噌的啊！像我这种苦磨技术的人，根本不跟他们在同一赛道。哎，就这样吧，未来我们都不一定是一类人。\r\n\r\n然后是贫困生补助的问题。我既然专门写了这个事，那这个事基本上不会干净的。我就不点名道姓了，反正确实有一些人并不贫困，但是脸皮像城墙一样厚，去声称自己该拿钱。有的人出勤带着索尼的 WH1000XM4，有的人每天用拯救者 R9000P 打游戏，有的人天天出门刷街旅游，但是他/她们竟然能够最终获得贫困的评定。但据我所知，一些真正贫困的人为了自尊，根本不选择上报。这种对比能够显示什么？\r\n\r\n总的来说，**天下熙熙，皆为利来；天下攘攘，皆为利往**。\r\n\r\n前几天，我躺在床上刷手机，突然有人打来推销电话。开头就准确讲出了我的个人信息，比我自己都清楚，然后问要不要跟机构备战考研。我其实很早就有这个想法了，来个人带带路，可以少走很多弯路。这时候根本没有必要“独立自主”，因为逞强也带不来任何好处。所以我很爽快就答应了，当晚试听完就交了定金。之后我招呼我的室友也去听听，但他几乎没表现出什么兴趣。\r\n\r\n周四的雨夜，几个学生坐在“专车”上，等着“返航”。我坐在副驾驶，只感到有些眩晕。这到底是个怎样的选择，我又是否会在未来感谢现在的自己？回想起高三时，一些老师逼氪未遂而露出的丑恶的嘴脸，和局外的领路人对我深远的影响。我感到未来似乎是光明的，但仍事在人为。之后我和室友坐在 KFC 里，讨论起这个事情。越说下去，我就越感觉陌生，就越不再是我自己——我再一次选择遗忘了我的过去。\r\n\r\n**有的人很看重这块跳板，有的人却坚信自我**，还有的人不知道现在自己站在哪里......"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7ba"
  },
  "id": "penyo-db-ts",
  "title": "做个大玩具，做个大孩子：PenyoDB.ts",
  "date": {
    "$date": "2023-07-11T00:00:00.000Z"
  },
  "category": "技术参考",
  "body": "印第安人有句谚语：\r\n\r\n> I hear and I forget. I see and I remember. I do and I understand.\r\n\r\n这表达了实践的重要性。\r\n\r\n前段时间，我回顾今年学的数据库的知识，感觉是时候练个小作品了。本来打算用 Java 写，但是正好近期刚学 TypeScript，想趁机也熟悉一下，就用了 Node.js + TS 的组合来开发一个 DBMS。\r\n\r\n在我的想象中，它应该是这样的：支持并发操作/文档型/含权限机制/有 ORM/有缓存机制等等等等。说实话，这里面的概念我都是仅限于知道是什么，但是具体怎么实现是一点都不了解。\r\n\r\n根据我浅薄的理论基础，觉得应该采用 MVC 设计，视图、模型和控制器分别对应 Shell 样式、ORM 和业务/服务层。\r\n\r\n先从视图入手，由于我打算致敬 MySQL Shell，就不做 GUI 了。一开始我打算自己开发一套语言系统，结果发现弄复杂了要设计语义二叉树，还得有点编译原理的基础。这就算了吧，最后决定兼容 SQL 语法，用 RegExp 来处理参数。这就是“上层”。\r\n\r\n中层我认为是对业务需求的实现，即常见的 CRUD。我只要把这些 API 干好，应该就可以了。结果这比我想的复杂多了，因为中层服务是操作 ORM 的集合，想写 API 得先把 ORM 设计好。\r\n\r\nORM 设计是最复杂的。之前做了好多 Java 小玩具，本来以为抽象已经练就一定水平，结果到这狠狠败下阵来。整个过程非常痛苦，迫使我回头狂啃设计模式，基本上就是边学边练。这段时间发的几个 push 基本上每个版本都改了不少内容。直到现在，我还剩几个关键类方法没实现。\r\n\r\n由于我之前从来没设计过权限机制，而这玩意是贯穿整个项目的，所以给我带来了不少麻烦。通过反复修改，我明白了实现细粒度控制是很厉害的一件事——虽然我最后只提供了三档。\r\n\r\n之后将 ORM 序列化也是很困难的一件事，因为直接明文保存肯定是不安全的。这块大部分时间都耗在加密上了。光一开始研究 ECC 和密钥管理机制就花了好几天，最后还是用的摘要校验草草了事。\r\n\r\n其实还有很多小技术细节，讲起来都挺有意思的（比如光研究 npm 就花了两天）。平常我们可能会提到这些点，但是一旦论如何实现、如何设计架构，就马上变得复杂起来。可以说，通过编写这个 DBMS，理论和实践水平都大大增长。\r\n\r\n项目目前就在我 GitHub 上开源，有兴趣可以去看看。虽然我知道弄的很烂，没有搞远程接入、函数、触发器、事务什么的，但是我还是觉得很有意义。前后花了将近 10 天，每天都在思考网上找不到的问题，确实是一件很有意思的事。\r\n\r\n之后打算深入学学一些东西，PenyoDB 我短期之内不会放弃，会想办法加料。有没有人用，其实我根本不在乎，这就好像搭积木——给自己玩的，何必在意是否要吸引他人。\r\n\r\n学，练，想，做。反复循环，推动自身不断发展。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7bb"
  },
  "id": "flow",
  "title": "闲暇",
  "date": {
    "$date": "2023-07-08T00:00:00.000Z"
  },
  "category": "随笔杂谈",
  "body": "很久之前，我读马克思的《资本论》，看到“异化劳动”的概念：在资本主义社会中，劳动者对自己产生的劳动结果疏离和失去控制。他认为，在资本主义经济中，劳动不再是人们自发的创造和满足需要的活动，而是被剥夺、异化和商品化的过程。\r\n\r\n这套理论被一些懒人搬来，就成了：你努力学习、工作就是被“异化”了，就是“内卷”。但不同之处在于，为资本家劳动是直接受到生存压力影响的，不一定是自愿的；但学习、工作却可以单纯的只为自己。古典学者从学习中获得朴实的欢愉，又何尝不是“放松”呢？非要在形式上进行娱乐，才叫放松吗？于是我发现我与周围人格格不入。\r\n\r\n很多人将“摆烂”奉为圣旨，觉得这是对残酷的社会的无声的反抗。但这是自我异化的产物——你自己都认为学习是为别人而学的、被迫而学的，又怎么可能在形式上做到真的学习呢？结果就是，花费了学习的时间，没得到学习的效果；强绷着神经累个半死，于是“学完”就去肆无忌惮地玩了。这也是为什么现在大学生那么水，本来学历（可能）就拉跨，还不认真学。一问四年学了什么，啥也不知道。\r\n\r\n其实在学校这座象牙塔里，我们能活动的范围还是很大的。虽然每天要上课，要去走个“形式”，但我们完全可以学自己的。如果我们习惯了狭义形式正确，就很难做到为自己而活——真的成了形式的附属品。\r\n\r\n于是我对他们讲述、对她们布道，只得到了满满的嘲讽，或是无言。没有人能接受日常全泡在学习里的人，至少是除了我以外的绝大多数人。这时候我才明白起来，*我可能并不应该在这里*。在无人之境，我审视着屏幕里的警告，花费忘记明晦的时间来思索。或捶胸顿足，或拍案称奇，浸泡着自己的神经在茉莉花茶般的遐想里。\r\n\r\n你问我是不是天天都这么忙碌，可我却认为我从未忙碌过。一个没有人逼迫、催收的事情，何来忙碌一说？倒不如说我是在踏青、在阅读，同样是花去了大片的时间，得到相同的体验。我的脑海中，就有这么一座私人园林或图书馆，供我随时拜访取乐。欣赏着一种常人所不解的风景，又何尝不是一件趣事？\r\n\r\n至于形式娱乐，那才是一种应酬。我在这时变得忙碌起来：因为我走不开，也推不掉，是为了达成某一目的而浪费时间。但我觉得这种浪费也是必要的安排，从功利主义出发，能够为我未来的“闲暇”创造条件。虽然我更像常人眼中的“机器人”，但是我感觉我还是有一点温度的，不是完全不食人间烟火。如果我身边的实体需要交互，我也会暂时退出状态来与他们互动。\r\n\r\n所以我喜欢那些能感同身受的人——能理解最基础的快乐的人。我愿意选择这种人为友，或者成为终生的伴侣......这样的人给别人一种感觉，就是别人认为他忙，但是他自己感觉却很闲。能随时进入“心流”的人，我相信一定是幸福的。因为他的积极只取决于他自己，而不依靠外界。与这种人相处，想必也是很快乐的一件事吧。\r\n\r\n想要得闲，先要心静。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7bc"
  },
  "id": "justice-and-righteousness",
  "title": "正义与正确",
  "date": {
    "$date": "2023-07-04T00:00:00.000Z"
  },
  "category": "评论",
  "body": "我们从出生以来，就在信奉“正义”。我们被教导如何为“好”，如何为“坏”。仿佛复杂的世界只是一架天平——从来都只有一段翘起、另一端垂下。\r\n\r\n但随着我们的长大，我们又渐渐发现世界不能用二元论解释。有的事情，它的结果成因错综复杂，单纯考量结果的影响是不够客观的。我们不知道该怎么定义这种看不见的准线，于是我们把这称为“道德”——一个只能感悟，不能定义的概念。\r\n\r\n法律则是另一根准线，它限制着我们在一定的范围内作出行为。与“道德”不同的是，为了捍卫机械公正的尊严，法律实际上被设计为禁止逾越的红线。一切的正确与错误，都是被确定的。即便能够司法解释，也很难偏离太多。\r\n\r\n虚无缥缈的“道德”引领着正义，不动如山的法律牵制着“正确”。两者都本该导向真正的公平，但真正的公平只应该有一个。如果我们说不清道德，那公平就是动态易变的；如果我们严格执法，那公平就是机械静态的。到底什么才是真正的公平呢？\r\n\r\n当我们看到新闻：又有谁十恶不赦被逮起来了，大家总是群情激奋，叫嚷着如何“处置”他。有喊枪毙的，有喊凌迟的，有喊连坐的......即便法官真的判其严厉的刑罚，也不能意气用事，听群众的意见使用酷刑。而我们说如何如何处置谁，其实是从披上“正义”外衣的邪恶出发，借着正义的幌子，欲行罪恶之实。我们甚至根本不关心真相，也不关心谁受惩罚（哪怕是受害者再吃亏），只想像看电视剧一样、看爽片一样，盼着所有人都死的死、伤的伤才好。\r\n\r\n即：正义，总是伴随着冲动，甚至在舆论的海洋中溺亡——化为乌有。而如果这个人是被冤枉的，我们不听他辩护（剥夺基本权利），或者快速判其有罪（程序不正确），他将只能得到“迟到的正义”——其实就是没有正义。这是非常的恐怖的一件事，这意味着我们的法律将成为一张废纸，人人意气用事，重回“人治”的封建社会。\r\n\r\n而如果极其严格地执法，则有可能会扑灭道德的热情——如正当防卫杀人仍判死刑。道德约束着我们自身，也在约束着所有人。一旦道德受到打击，对整个社会都会产生深远的影响。如因*冲业绩、方便自己办案*而非法拘留、刑讯逼供、种族歧视（在中国大陆表现为执法者歧视汉族人或者男性），使得人民不再相信国家暴力机关和司法系统（能够保护自己），会为了维护私产而做出残忍的手段。\r\n\r\n一般来说，正义和正确都是由人民确定的。我们大多数人对它们的考量铸就了它们的含义：比如我们知道见义勇为是正义的，捍卫自己的利益是正确的。虽然这并不是宇宙的真理，而是人定义的，但是在特定种群里，人人所信奉的就等效于真理。可我们一旦将解释权交给少数人，或者说明白些——特定的一些人，这些人就可以随心所欲地利用自己的解释权，让公正的天平倾向他想要的那一侧。而人民一旦屈从于这种淫威，公正就会消失。\r\n\r\n因此，除了我们自己要清楚是非，还要保持冷静，将公正普及给他人，社会才能良好的运转。说出来不够，就要喊出来；喊出来不够，就要团结起来。如果我们都是精致的利己主义者，为了达到目的可以不择手段、不在乎社会公平和他人福祉，那我们就永远只是社会的垃圾——从生出来就流淌着腐败的血液。\r\n\r\n为众人拾柴者，怎能使其冻毙于风雪中？如果我们把对社会的贡献都当作难以企及的事情：比登天还难、比再创造一个乔布斯都难，那我们的未来真的就没有希望了。为什么我们的利益、我们的未来与我们却没有关系？凭什么我们不能决定我们的存在？只指望着他人为我们“伸张正义”，想必有一天也是可以变成任何人的吧。在打仗的时候当汉奸，在盛世的时候当党员；在骑单车的时候加塞，在开 BBA 的时候路怒......\r\n\r\n我知道我身边几乎全是这样的人，我也知道中国有很多这样的人。他们自私、刻薄、势利，没有原则与准线。而我不愿与他们为伍，即便会受到嘲笑：像孩子一样幼稚、像傻子一样天真。我天生不是理想主义者，但是我是坚定的规则与美德的维护者。\r\n\r\n当威压来到我们每个人的头上时，你是否会期盼光明的裁决......朋友们，我确实非常沉重地，想要问出黑白。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7bd"
  },
  "id": "persecution",
  "title": "愚民政策、思想控制、言论审查与典范转移",
  "date": {
    "$date": "2023-07-01T00:00:00.000Z"
  },
  "category": "评论",
  "body": "早在战国时期，统治阶级就开始意识到不能让平民过于博学，否则会威胁统治（*诸子百家带来了政见不同*）。为了阻隔阶级流动，人民的受教育被限制到了一个非常小的范围里，如工学、农学等自然科学，而人文科学则由上层所掌握，尤其是一些**驭人之术**。为了阻挠人民有时间去了解这些上层学问，统治阶级一般会将人民的生活水平限制在勉强维持生计的水平，使他们每日疲于奔命（*《孟子》中的“三脚鼎”故事和商鞅的“壹民、弱民、疲民，辱民，贫民”一说*）。尽管仍有一些统治阶级开创了一些制度，使得底层的新鲜血液能够进入上层，但对于全体人民来说其象征意义远大于实际意义。\r\n\r\n为了让人民认识到他们正在经历的生活是“美好”的，统治阶级异化了孔孟之学，向人们传输安居乐业、帝王至尊和宿命论的思想，用礼教束缚人民、体现社会等级制度。在反对之声难以出现、上层洗脑不断和自身愚昧单纯的情况下，人很容易失去独立思考能力。哪怕发生战争，他们也只会觉得是“不幸”而不会觉得自己是政治斗争的牺牲品。最典型的例子就是苏联：一出现负面新闻就赶紧掩盖（污染信息源）、媒体由当权者完全控制（污染信息传输途径）、用集体主义和虚无缥缈的“信仰”绑架普通人（污染信息接受者）。尽管党内外都有人意识到这点，但由于无法与其他人有效结盟（信息无法传输），最终只能眼睁睁看着苏联解体，红色果实被亲美派窃取。\r\n\r\n到了明清时期，随着人民生产水平增长，读书开始走进寻常百姓家。为了防止人民觉醒，发现封建制度的缺陷*或纯粹的讥讽/革命*，实行了一系列行为，用于对文人政治迫害。\r\n\r\n> *明成祖靖难登位，大杀忠于明惠帝的大臣，禁止这些大臣的著作流通，**又惧群臣百姓疑其得国不正**，焚烧被其认为有讽刺之意的书籍、戏曲剧本。明世宗时为明朝文字狱第二个高峰期，明世宗经常**因诗句中有讽刺之意**而杖打或囚禁大臣。明中后期奸臣当道，**党争激烈，敌对大臣会找出政敌的文章诗句中有可疑之处弹劾对方**，而往往皇帝亦同意这些是讽刺当朝的作品。*\r\n> \r\n> —— 摘自 Wikipedia 词条：文字狱\r\n\r\n在这种环境下，无论你是有心还是无心，只要言论上有一点不“得当”，就会身陷“文字狱”。逐渐地，对单一著作或人民舆论进行审查的行为也从**从上至下的迫害**异化为了**人人自危的自查**。通俗的来说，你如果想要“坚持正义”，就要先想想会遭到什么程度的打击报复。所以这种模式下的媒体就不再是传统意义上的媒体，而是成为了“只说好话、只报道好事”的傀儡。\r\n\r\n总的来说，愚民政策、思想控制和言论审查都是统治阶级为了维护自身权力或保持国家稳定的手段，实质是侵害了被统治阶级的人权，属于极左政策。一开始先使你愚昧（没有思想），若未能得逞，就开始控制你的思想，若仍未达成，就要限制你的发声。目前世界上几乎所有地区都已经来到第三阶段，尤其是一些左派意识形态，会更注重这一方面。\r\n\r\n此外，一些政权为了包装/美化自己的邪恶/反人类行径，会将自己的手段与一些科学理论强行捆绑在一起，并重新赋名以获得形式正当性。常见的例子是宣称自己是正统的马克斯主义实现者，如苏联。乔治·奥威尔的小说《一九八四》就着重描述了这种行为：*只要思想是建基于语言，语言的简化和控制就是简化和控制思想。*小说构思了一个全新的语言：新语。在新语中，“自由”（free）一词仍然存在，但其意义仅限于免除、没有、免费：这只狗身上没有虱子（This dog is free from lice）或这块田没有杂草（This field is free from weeds），而不能用在政治自由（politically free）或思想自由（intellectually free），政治自由和思想自由已经没有字词可以代表，所以相关概念亦已消失。其他如荣誉（honour）、正义（justice）、道德（morality）、科学（science）、宗教（religion）等干脆消灭，或包含在思想犯罪（crimethink）或旧思想（oldthink）中，不再精确细分。\r\n\r\n如果一些词汇的意思被异化了，以至于它被提起时已经无法使我们想起其原本的含义，那么这种现象就被称为**典范转移**。比如强行把两个词结合为一个新的毫不相干的词，或者将一个词在特殊语境下的含义作为其本意等等。举个例子：疫情。疫情的本意是瘟疫发展、传播的情况，但是前几年在我国被代指为瘟疫本体。因为反复提及“瘟疫”会让人感到恐慌，但是“疫情”就能减少恐慌。至少是能让人们克服死亡的恐惧、安心接受指挥。现实中典范转移的例子还有很多，但由于我需要自我言论审查来自保......不多说了。\r\n\r\n实际上，这是一场统治阶级与被统治阶级之间的战争，且永远不会结束。无论是修正主义、正统马列主义还是无政府主义，由生理（进而导致政治）实力差距导致的压迫会永远存在。妄想依靠他人为自己带来福祉是不可能的，要想获得一切，必须靠自己的努力。可以从读书开始，也可以从健身开始。通过实践了解社会运作的机制，探究自己在社会中的（地位）情况，从而规划好一条能够精准自保的路。在比共产主义更优越、实用的社会体制没有被构想出来前，我们其实没有更好的选择。因为物质水平跟不上，人民水平也跟不上——所以社会主义实际上才算当前最优越的社会形态。\r\n\r\n天下诸君三言两语，真真假假，假假真真。几分真心几分讥，更劝君，明心智，品味其中苦与甜。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7be"
  },
  "id": "pb-1_5",
  "title": "Penyo Blog 2.0？1.5！",
  "date": {
    "$date": "2023-06-20T00:00:00.000Z"
  },
  "category": "技术参考",
  "body": "二月份的时候，PB 的核心代码一锁定，我就在考虑下个大版本的事了。\r\n\r\n说实话，就 Github Pages 那么点发挥空间，我很难一口气带进来太多东西。它只允许载入静态页面，或者说，不能把狭义的后端带进来。但像博客这样的网站，肯定是要依靠数据库的，没它你怎么做呢？\r\n\r\n一开始我的方案是直接把数据嵌到页面里，也就是非常“纯真”的静态。但这样到后期肯定不好维护，比如页面结构要变动，就得一一修改所有子页面。那么我的数据必须要集中存储在一个地方，再由 JS 填充到**模板**里，这样才行。\r\n\r\n众所周知，DBS = DBA + DBMS + DB。静态之所以成不了动态，并不是因为 DB，而是 DBMS。所以我只要设计一个基于 JS 的 DBMS，就可以纯前端挂载数据库了。但又众所周知，我是懒比，我肯定不可能去设计一整套 CRUD 逻辑还有一堆高级功能啥的，就简单查就行了，增删改由我自己手动操作完成。就算只做查，我也不想搞功能抽象，就直接把数据文件按特定方法读了得了，顺便把结构化也集成到里面得了。\r\n\r\n那数据文件放哪呢？一开始是随项目一起，但这样每次更新数据库都会污染项目的更新记录，这样不好。于是我又另外建了一个 Git 仓库，把数据文件放里面了。到时候网站读我这数据库，还不会提示跨域警告，美滋滋。这样做唯一的缺点就是，数据不安全，能够被任何人获取到（没有用户账户和数据加密机制）。不过考虑到我博客本来也是给别人看的，这点原始数据想看就看吧。文件格式么，为了便于操作，就用 JSON 了，对于 JS 来说也方便结构化，这点算是借鉴了 MongoDB。\r\n\r\n关于读取数据，还有点小故事。众所周知（又来了），数据文件并不能瞬间被读取完，因此直接用 `JSON.parse()` 来读是获取不到对象的。因此必须用异步编程，当完全拿到文件后才能结构化。一开始所有地方全用的原生技术，只有读数据用的 jQ 里给的异步函数。说来我确实是懒，那么长时间一直只知道异步的原理，但是代码从来没实操过，所以这块一直没动。昨天一时兴起，试了下 `async/await`，结果发现太强大了，这下不得不替代掉 jQ 给的异步了。jQ 载入本来就耗时间，这一去掉能快不少。\r\n\r\n然后就是界面和交互逻辑设计。由于是原生技术，所以很难玩出什么花，哪怕是一个切换主题也曾经给我头疼了好久。后来学了 Vue 之后发现，其实我这个项目用 Vue 做是可以大大简化的。那为什么不试试呢？于是试试就逝世。我发现要把项目迁移到新技术栈难度很大（设计之初没考虑组件化，导致模块耦合太强），再加上我非常手欠地勾选了支持 TS，直接难飞了，还不如重构呢。但是如果重做，我为什么要复刻呢，为什么不直接弄个高大上的呢？\r\n\r\n哎，打住！先把 Vue 学完行吧。就会的那点鸡毛蒜皮，啥都做不出来。但是又实在是手痒了，毕竟 Vue 那里学到了很多新的设计思路。所以 Penyo Blog 2.0 先不放出来，顺手做了个 1.5。练练 ESM，为下个大版本打好基础。就这，还花了我将近一整天。\r\n\r\n我现在对于 2.0 还有很多畅想，但苦于技术有限、创意有限，还弄不出原型。继续学习吧，等啥时候有墨水了再回来搞。正好暑假实训也要训练使用 Vue + TS，确实是很好的安排。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7bf"
  },
  "id": "straddle",
  "title": "冷眼下的缩影",
  "date": {
    "$date": "2023-06-15T00:00:00.000Z"
  },
  "category": "评论",
  "body": "是什么在推动我们的进步？\r\n\r\n他们避而不谈，只是在赞颂苦难。要多吃苦、多吃亏，最终会幸福的。而这张画了快一百年的大饼，已经饿死了多少朴实善良的劳动人民。\r\n\r\n于是，我看到某座大厦，它的根基正在慢慢崩塌。农民们，把自己埋葬；工人们，成为人下人；只有先富起来的人，再也不在那里。而抬头望去，无论是毛公诸类，还是邓公诸类，都已经躲进历史的尘埃。只剩下投机倒把者，手捧新时代的《圣经》，高唱着虚无的凯歌。\r\n\r\n在这种环境下，人很难不变得自私、刻薄与势利。况且，这本来也是我们的优良传统，是万万不可丢弃的。至于“仁义礼智信”，那也只是贴在地基上的牛皮癣广告罢了。他们看不见，也不需要看。\r\n\r\n我们常标榜自己是礼仪之邦。对于外邦来说，确是有礼。但在邦内，却有着最严苛与刁钻的方法为难彼此。就说明白些，中国人坑害起来中国人是最正宗、最彻底的，各自没什么团结可言。面对同仇，大多只会丢盔弃甲，毫无血性。因为我们受尽了孔老二之辈的封建礼教束缚，只会当帝王手下的狗奴才。唯一的智勇，也只体现在寻衅滋事和搜刮民脂上。\r\n\r\n我们给国外的“蛮族”赋予各种蔑称：高丽棒子、东洋倭寇、南越猴子......但一看我们自身，却也不是什么好种。外国人说我们会做生意，但我看见有人投机倒把、发国难财——五十年前如此，现在如此，想必五十年后也如此，那么我很难不认为我们有些人比二战前德国的犹太人更可恶。有才无德倒还好些，只怕是又无才又无德！\r\n\r\n你讲刚建国的时候，人有信仰，我是相信的。但现在，但凡是有点本事的，都不会留在这是非之地，陪着一些将死之人玩老祖宗留下来的游戏。留下的、回来的，那基本上都是没有料的。一层骗一层，给时代的红利披上鲜红的外衣，直到不得不揭幕露馅。\r\n\r\n古人云，唯小人与女子难养。几千年过去，居然什么几乎也没有变，这句话仍然适用，甚至是更加适用。小人以前是什么样，现在还是什么样；（有些）女子以前是多么无德，现在依旧如何无德。去行不正之术，贯阴柔之风。什么政治正确，什么现实，都只是想做淫秽之事罢了，顺便刮点油水。裤子一脱，哪有什么信仰，全部在高潮里忘完。\r\n\r\n而我仍然冷眼观望着这一切。人口数量几千年来不断上升带来的经济总量上升，却没能改掉心里的贫穷——尤其是我们一边西化一边“抢救”时，最为滑稽可笑。我们比文明古国印度或者科技新星美国更高贵吗？是更残酷的种姓制度，还是更烂的社会福利？哦，不该用“高贵”，而是“优越”！\r\n\r\n他们也在观望，像下一盘棋——玩一局飞行棋。什么时候吃子，就像栽赃、杀人一样轻松。不同的，只是从造反变成了寻衅滋事，从砍头变成了枪决。对这一切，你可以选择沉默或者赞颂。因为批评会招致杀身之祸，他们容不得真相泄露出来。\r\n\r\n于是，我偷偷抹了一把眼泪，继续走向地基——我最终的归宿。远看是千万根柱子，近看却是一个个我：像我一样的行尸走肉。这些耗材已经忘了他们是谁，只有埋没在烟尘中的编号们在哀嚎。越是靠近看清，就越是停不下脚步。\r\n\r\n普通人注定会是这样的吗？我战栗着。身边的人，或在感同身受，或仍在麻木，都在自危。无法讲述，无法拒绝的未来，留给我们的是一个惨淡的摊子，一桌无人问津的残羹冷炙。\r\n\r\n此时，我希望我是愚昧的。因为，智慧只会给我带来更多的痛苦，却改变不了我的处境。空有智却无勇，我宁愿不要这残缺的智慧，也当一只老老实实的牛马。可有的双全之士的大声质问，却唤醒了我的潜藏的血性。我们能否觉醒，能否建立新的大厦？这不是一个哲学问题，也不是一个政治问题，而应该是一个未来的历史问题。\r\n\r\n我看见为了自身利益而争取者，我看见为了司法公正而较真者，我看见为了群体觉醒而战斗者。为众人拾柴者，怎能令其抱薪冻毙于风雪中？\r\n\r\n故而，进步靠的是我们自身的争取，而不能坐享其成。他人的先祖的慷慨，并不能恒久远。如果我们不能明白这个道理，就要永远甘为人下，做一辈子真的牛马，最后倒在无边的缩影里。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7c0"
  },
  "id": "await-u",
  "title": "单向等待",
  "date": {
    "$date": "2023-06-04T00:00:00.000Z"
  },
  "category": "随笔杂谈",
  "body": "我本来该是一团炽热的火花，但却已经迎头撞上了太多盆冷水。于是我黯淡了，却仍保留着再一次剧烈地燃烧的愿望。我太幼稚，把自己的一切毫无保留地展示给你，可却换来了空荡荡的消磨。这不禁使我困惑，我应该怎么做？\r\n\r\n我掩盖，我逃避，我忽视着你的冷淡，但是我的内心却放不下那种愿望。我也是人，我也是有感情的。人怎么能够真的抛却七情六欲？哪怕是和尚，也有破戒的时候，更何况我只是一只热烈天真的白羊。我思考不了那么多，猜测不到你的复杂的心。\r\n\r\n于是我开始“练习”，我开始变得“细腻”。我不断写着、看着各种各样的小作文，把自己带入到你的生活中。我希望抛弃我的原本的人格，追随你，最后成为你。这种几乎疯狂的爱恋，却是以暗恋的形式展开、以悲剧的形式展演。而你，甚至不会知道这一切。因为我还在伺机，什么时候我能变得更好，才能勇敢追求你。我一边嘲笑着自己成为了隐形的舔狗，一边警告自己正在沉沦。\r\n\r\n这种复杂交织的冲突感情，把我变得四不像。我既不是我，也不是你。我变了，再也不热情了、再也不大方了。我进入了迷失的年代，一个人孤独地走在自我困顿的迷宫里，寻找着并不存在的出口......\r\n\r\n但我仍然爱你。如此渴望你，像沙漠里渴水的杨木，我发觉我已经离不开你。每天，我都在幻想一种情形，但终归是不能成真。我知道这是无穷尽的内耗，但我从中走出来，却花了那么多年。我开始尝试恢复正常的生活，像人一样，像阳光下的人一样。而此时，我们已经相隔太远了，甚至是永远分开了。\r\n\r\n你不会知道，我也不希望你知道。在昏暗的日子里，你是我精神的支柱，将我数次从毁灭的边缘拉回来。为了你，我甘愿不断放弃很多东西，而走上更好的道路。无论是“卷”，还是“肝”，你都像一股无形的力量，将我推动。\r\n\r\n如今，我们之间已经完全切断了。但我也不会再懦弱地伤感，而是继续走下去。我也许会一直等着你，也许不会。未来是变幻莫测的，谁又能知道有什么会跳出来改变结局呢？我想，我必须变得更强大，无论是心理还是能力，去匹配更好的“你”。\r\n\r\n“你”，在我心中，已不再是你。除了名字，我已经快忘了你的一切，但是你有闪耀的轮廓将我照耀。你已经成为一种象征，指引我做出未来的选择。“你”，也当然可以是你，但我已经洞见更好的她。尽管她还像你一样仍对此一无所知，但是，这一次，我不会再丢失机会。\r\n\r\n当我决定结束这段等待时。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7c1"
  },
  "id": "jupiter-iii",
  "title": "木星三期规划与职业未来展望",
  "date": {
    "$date": "2023-06-03T00:00:00.000Z"
  },
  "category": "随笔杂谈",
  "body": "自从 Jupiter Project 实行以来，其已创造超过百万字符的数字笔记。这一超大规模的、跨越数年的教育类工程，在个人的求学生涯中发挥了极其重要的作用。转眼间，第三年就要来了。是时候审视过往的不足、展望未来的需求了。\r\n\r\n今年年初，OpenAI 发布的基于 GPT-3.5 LLM 的 ChatGPT 颠覆了所有的文字创作行业，用快速、正确、完备的普及型 AI 对人类职业进行了洗牌。我作为软件工程专业的学生，感受到了这份压迫感。对于一些中低级工作，它能够很好的取代人类。如果描述需求得当，它甚至能在短时间内创作出人类需要构思许久的内容——无论是艺术还是技术。尽管总有人唱衰其，认为其只是机器计算罢了，永远不能赶上人类。\r\n\r\n对于市场来说，缺乏特殊技能的 IT 民工有望在短短几年内被快速淘汰。面对更快、更准确、更“恳切”和更经济的 AI，从事中低级劳动的我们还能做什么会来反抗？一切我们需要花大量时间学习的东西，都将成为笑话。妄图靠人脑对抗机器算力和存储力，是不现实的。保守策略告诉我们，其实设法进入管理层或者继续深造，避开拼劳动力的红海就可以了。但是中国有那么多人，不可能所有人都是管理层；也不可能会有那么多 AI 让我们来管理。\r\n\r\n所以我们只能固守“创造”的高地。在我看来，创造不是重复造轮子，而也许是改写模式规则、制定规则。因此我认为计算机革新的风口可能是摆脱冯诺依曼结构的束缚、发展下一代的量子计算机。当前晶体管密度已经迫近物理极限，想要在物理层上再提高性能密度，已经是难上加难；单元架构设计也是难以发展，加减器再怎么设计，也很难降低时空复杂度。这不得不提[苏姿丰](https://zh.wikipedia.org/wiki/%E8%98%87%E5%A7%BF%E4%B8%B0)了，她本来是我理想的**原型**。\r\n\r\n但我看见了大众娱乐的潜力：它是经久不衰的，它是上层建筑中的璀璨明珠。它将工程与艺术很好地结合起来，既有工匠的心血，也有艺术家的打磨。作为千禧一代，我很难抗拒加入创作的诱惑。[PGF](https://github.com/penyoofficial/penyo-gal-framework) 是我的第一次尝试，它不需要太多后备知识就能完成。从构建的简易性上，我看到了充满可能的未来。但此时，想要再迈进一步，就要付出更多的努力。\r\n\r\n因此我希望能在计算机图形学、软件工程、人工智能（如基于 LLM 的）等方面深造，用优雅的方式构建出更好、更完善的工程。同时，安排好考研所需的一切。最稳妥的选择是一直栽在软件上不动，但是我也一直希望能在硬件设计和制造上有所建树。此外，艺术方面也需要更多造诣，我作为图形艺术的外行，还有很多东西需要学习。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7c2"
  },
  "id": "ghg-utopia",
  "title": "Girls help girls：永不可达的乌托邦",
  "date": {
    "$date": "2023-05-28T00:00:00.000Z"
  },
  "category": "评论",
  "body": "先说结论：大力主张这一观点的一般都是只谈特权、不讲义务的普女。看不下去的可以直接走了。\r\n\r\n其实无论是哪个国家，“女孩帮助女孩”都只是摆在明面上的标语罢了。根据美国《应用心理学杂志》的文章[《Female CEO and the compensation of other top managers》](https://psycnet.apa.org/record/2022-25714-001)，美国公司选择女性作为 CEO 一般是为了彰显“多样性”（Diversity），即：我们需要女性担任一个位高权重的人物，来彰显我们的政治正确。结果女性担任高管后并不会多多提拔或者优待女性，而是生产力至上：最后体现在公司男性占比非常高。而日本那边，由于有[《男女雇佣机会均等法》](https://www.mhlw.go.jp/content/000497321.pdf)（限制男女比例），因此日本公司纷纷开设**庶务课**，按最低工资标准发放薪酬，招聘大量女性做公司里的杂活。这对于职场里的精英女性来说是不友好的，因为在生产力需求的驱使下，精英女性无法放松自我，要与男性卷体力，否则就要面临淘汰。而庶务女性也不会体谅精英女性，只想着在公司里摆烂，拖累公司运行。至于我国普女比较向往的欧洲或非洲，前者是三天饿两顿，俄罗斯一掐能源，你连供暖都开不起；后者是......活着都成问题，还提待遇和互助？这些都是高层建筑，没有底层男性提供巨大的生产力，一切将化为乌有。\r\n\r\n说了那么多外国的事，再来说说我国。根据华农大与浙大学者文章[《女性 CEO 会雇佣更多的女性下属吗？ ——基于中国家族上市公司的经验数据》](http://zzs.zjgsu.edu.cn/gl/CN/abstract/abstract10216.shtml)，我国家族上市企业女性 CEO 非但未能增加公司中女性高管的比例，甚至是所有家族上市企业中最低的。（题外话：为什么这里只研究了家族企业呢？欢迎讨论。）也就是说不同阶层的女性是不会“互助”的，那么同阶层呢？可以参考我国大学女生宿舍普遍情况，或职场中同阶层的有竞争关系的女职工。即：在自我的利益面前，其他女性的利益是可以牺牲的，甚至是要优先牺牲的。如果能借着其他精英男性攀上更高的位子，反而是要“机关用尽”来“媚男”。因此并不存在*广泛*的“Girls help girls”（女性牺牲自己成就其他女性），[张桂梅](http://www.moe.gov.cn/jyb_xwfb/moe_2082/2021/2021_zl37/shideshiji/202105/t20210511_530873.html)那样的属于极其极其少数。\r\n\r\n在我国的传统教育中，男性从小被教导要“顶天立地”、“谦让女性”和“养家”，女性被教导要“贤惠知性”、“体谅男性”和“安内”。在历史中，宏观表现为男性生来就是要“沉默”与“劳作”的，为的是“爱妻”与“养子”；而女性要体现自己的“生育价值”和“家务价值”。这种小农经济的产物放在当下其实仍未过时，因为社会经济结构仍然未变：少数人把握着巨量财富，绝大多数穷人争抢贫瘠的社会资源。西方政客为了选票，为了博取传统意义上的弱势群体的支持，刻意抬升女性的社会地位。但实际上，底层男女基本上是平等的，不存在显著差距（综合来说）。抬升底层女性后，底层男性成为了最大的受害者，仅仅是因为底层男性不会“说话”。是我们刻板地把“高收入”、“身体强壮”定义为强大和高等，即男性拥有的特征。这本质仍是对男性（力量）的崇拜，没有脱离丛林法则的束缚。而女性所操持的工作被视为“低能”、“压迫”。难道小家的劳作和“大家”的劳作不是均等的重要吗？钢铁和丝绸都有其优势，并不能将钢铁的优势作为衡量“好”的标准，尤其是拿这套标准绑架丝绸。\r\n\r\n本来西方那套理论就有问题，传到国内更是变味。现在传统对男性的要求是“优良习俗”，对女性的要求成了“压迫”。即男性不能抛弃原有的职责，而女性却可以什么也不干就获得男性的经济支持。她们一边坐享其成、游手好闲，一边抱怨自己（前辈）付出的太多，颇有得了便宜还卖乖的感觉。当这种风气成为潮流，就成就了今天的中国。而这种潮流，也被某些动机不纯的人包装为“**她力量**”。因此说，中国田园女权的本质就是底层女性利用政治正确舆论压榨底层男性，而精英男性她们基本上是碰不到的。当两个普女有着共同的利益时，她们会叫嚣着“Girls help girls”，一致对外（男），但一旦利益互斥时，别说什么公平竞争了，都巴不得把对面吃了。这是我们的现代教育出了问题，当今学校的女老师太多了，她们处理问题的时候多少会带着一些田园女权的影子。这既是对男孩的威压，也是对女孩的“教导”，最终把一代孩子全部变成[沸羊羊和美羊羊](https://www.zhihu.com/question/522405239)们。而独立思考社会运行的本质，早已成为奢望。\r\n\r\n因此，性别不是鸿沟，自私自利残忍刻薄才是。我并不意外“Boys help Girls”或者是“Girls help Boys”，因为这才是健康社会的常态。一个群体抱团有时不一定是为了取暖，而是为了开展更残忍的同类屠杀（详见[蛋壳公寓事件](https://www.bilibili.com/read/cv8521725)、[蟹珍珍事件](https://www.zhihu.com/question/597712505)）"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7c3"
  },
  "id": "travelogue",
  "title": "出行小记",
  "date": {
    "$date": "2023-05-20T00:00:00.000Z"
  },
  "category": "随笔杂谈",
  "body": "别买劣质电源！我这次深刻地理解了这句话的含义。\r\n\r\n几天前，当我把光驱接入笔电时，笔电直接黑屏了。我没有意识到，这是一个警告。于是我重启了笔电，重复了刚才的操作，于是......笔电彻底嘎了。\r\n\r\n经过两天对规律的摸索，发现笔电只要通电（含电池），主板某部就会持续发热，且无法开机、指示灯不亮、风扇不转。这种情况我从来没有遇到过，暂且认为是光驱的过压/过流脉冲通过 USB 接口损坏了笔电的某干线元件。\r\n\r\n一个 CS 人，电脑嘎了，这怎么玩？修！经过查询，合肥还真有官方授权售后点。虽然神舟被诟病不好售后，但是“大城市”会 miss 这个缺点。哎，不得不说，我们省会真是太优越辣！\r\n\r\n废话少说，次日（周六）上午弹射起床。按照规划，我要先骑共享单车 5km 到最近可用的地铁站（为什么学校门口的还没修好？），再乘一号线到合肥南站，再站内转乘五号线到科大东区，最后步行 1.5km 到目的点。\r\n\r\n怎么说呢，共享单车和一号线我可能还挺熟的，但是五号线我从来没坐过。我猜测可能要出点小插曲。\r\n\r\n不过插曲比我想的要来得早：先是共享单车骑到地铁站门口还不上车，折腾半天才还上，但是因此多扣钱了；然后就是头晕脑胀弄错了一号线的方向，差点坐反。终于，我“坐”上了正确方向的五号线：但是全程罚站——也在我意料之内，毕竟是“520”，小情侣出来玩很正常。你说得对，但是今天是大太阳，最高 31°。而我是将近十一点出门的，正好承受这烈夏的威压。这种天气有出门的必要吗？等我费大劲，进入最后一段 1.5km 后，真正的精神折磨才刚刚开始。\r\n\r\n![](https://pic.imgdb.cn/item/64d1d4de1ddac507cc6b5379.jpg)\r\n\r\n先不说不熟悉地形多绕了一段路，就路过科大那几百米，是最煎熬的。远远看见红墙高立的“什么什么楼”，我就知道这是高贵的科带。顿时我有一种自卑的感觉，臭带专来科带门口晃什么啊？见到酒吧舞爷还不速速绕路退避？胡思乱想了好一阵，却才走过一两百米，我更难受了。看见里面建筑里来来往往的学生老师，我唐突脸红起来，不知道怎么搞的就想到了一些奇怪的事情。\r\n\r\n我猛地摇摇头，哎，别忘了自己是来干什么的。于是我加快步伐，背离我曾经或一直向往的地方而去了。穿过老城区的旧建筑群，我终于来到了落寞的“电脑城”。我又神经紧张起来：怎么售后点在这啊，会不会狠狠坑我一笔啊？电脑城！小品牌！维修！三个 tag 合一块简直就是地狱体验。\r\n\r\n不过等我见到神舟的人，又放松了下来。就很正常的一对夫妻，是我想多了，总把 IT 行业的线下从业者妖魔化了。他们很和善地接待我，询问完问题，让我填了个单子，说要返厂一到两周，然后就没了。\r\n\r\n我走出“赛博广场”，心里有一种说不出来的舒坦。很快，又要路过某知名大学了。它那门口西边有个很大的交通要塞，行人等待处没有遮阳的地方。我刚想快步通过，发现红灯还亮着，便止步了。而我面前有个衣装整齐的中年人，看着像是科大的教授？他本来也想速闯，但是看到旁边来了个学生模样的人（我）驻足，便止住了迈出的脚。这搞笑的红灯有 70 多秒，我们就这样大眼瞪小眼干等着，看着其他人肆无忌惮地走过。\r\n\r\n那么众所周知，坐牢是守恒的，只是从我的身上转移到了别人身上。等完全路过科大，我快步进入地铁站。瞬间，凉气吹拂我的每一个红温的毛孔，安抚了我急躁的心情。\r\n\r\n坐在地铁上，我左右张望了一下，各种男女、各种搂抱、各种情趣穿搭，灌满了我干涸的眼。这时，我又想到了一些奇怪的事情，不由得怀疑起来自己的立场。我不知道该做些什么来度过这尴尬的旅途，只好装模作样打开手机上下划划屏幕，但是实则没有任何心情去看。\r\n\r\n这种迷糊一直持续到骑车闯了一个合带门口的红灯才结束。啊，我在干嘛？不要命辣？几分钟后，我出现在了宿舍里。空调安抚我的惊魂未定的心，把我的火熄灭。我不由得感叹，这半天实在是魔幻，也许是内心戏太多，也许是太矫情敏感，但终归是达成目标。\r\n\r\n坐在椅子上，我望向劣质电源适配器和劣质光驱，我突然有了一种冲动，把它们打包起来全部砸碎。啊，可恶！"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7c4"
  },
  "id": "the-ninth-art",
  "title": "第九艺术",
  "date": {
    "$date": "2023-05-04T00:00:00.000Z"
  },
  "category": "随笔杂谈",
  "body": "黑格尔在《Lectures on Aesthetics》中提到，“五大艺术”是建筑、雕塑、绘画、音乐、诗。它们分别对应了大型工程艺术、小型工程艺术、图形艺术、音乐艺术和文字艺术。后来舞蹈、电影和戏剧也被后人加入，这便有了“八大艺术”的说法。\r\n\r\n后三者确切的来说，它们都是以人为中心、注重展示人本身的形态（属性）和动作（行为）的对象。它们自然也符合艺术的定义：有技术性、是上层建筑的产物、以自身独有的方式认识世界。以古典角度来看，就是能以道德目的为导向而进行实践。\r\n\r\n20 世纪下半叶，电子游戏（下称“游戏”。这里需要与赌博或传统游戏有别）兴起。它以电子计算机为活动主体，为人展示文本、图形和音乐的集合。当三者很好地结合起来时，能够给人一种模拟/超集化现实世界的感觉（因为占据了主要感官），并通过游戏过程让人感受美与愉悦。因此，游戏也被称为“第九艺术”。\r\n\r\n之所以被称为第九艺术，是因为游戏的设计是无比精妙、内部模块无比契合的。这体现了文字艺术、图形艺术、音乐艺术和交互艺术的自如运用，对开发者/编纂者的综合技术/艺术水平进行了深度考察。即：在不合作的情况下，一个人被要求是全才，才能开发出一个狭义的游戏。\r\n\r\n多数情况下，游戏中的文学是以对话的形式出现的。因为对话是现实世界中最常见的文字表达形式，书面的、复杂的用语根本不能拿来使用。由于对话具有个异性，因此通过雕琢对话内容可以打造一个基本立体的人物形象。很浅显的来说，粗犷的语言和细腻的语言绝对不会让人想到能是同一种人。若是要再细一点，那就要跟红楼梦里的句子掰掰手腕了，不符合实际情况。\r\n\r\n之后就是绘画。我们读到的东西和听到的东西都不一定直观，因为它们本质上是一种特殊的加密信息，需要经过大脑“解码”才能理解意义。但图形不一样，一个好的图形可以跨越人种甚至是物种来表达信息。如果图形还具有一定的美感，那更是能令玩家深陷其中。\r\n\r\n最后是音乐，这里专指协和的无人声音乐。对于人类而言，当我们听到一段旋律的时候，能分辨出音乐表达的情感。因此这主要用来渲染游戏中某个时刻的气氛。比较好懂的例子是，你在婚礼现场很清楚该播放什么样的音乐、不该播放什么样的音乐，当然是要节奏快的、低音部弱的、方形波少的（只代表部分情况）。\r\n\r\n你需要在这些领域都有很深的造诣，才能打造出一个“第九艺术”。可见个人开发者的含金量是很高的，能做出来的小团队也不赖。目前就国内的情况来看，真正的游戏艺术并不多，大多数是为卷钱而生、卷不到就跑的那种，比如腾讯、网易、完美等行业龙头企业下辖的绝大多数项目。当我们习惯了看三俗，就再也入不了高雅殿堂，而后也就没有人再愿意费尽心机打磨艺术了。\r\n\r\n我迫切的希望阻挡趋势的车轮，但仍有长路在前......"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7c5"
  },
  "id": "she-economy",
  "title": "“她经济”与即将崩塌的无产阶级",
  "date": {
    "$date": "2023-05-02T00:00:00.000Z"
  },
  "category": "评论",
  "body": "新文化运动后，西方先进思想迅速涌入国内。其中，最为耀眼的就是**男女平等**。中国作为老牌封建主义国家，对底层女性的迫害、物化已经持续几千年。新时代女性迫切希望提高自身地位，不仅仅是为了保障生活质量，也是为了提高社会综合生产力。为了赞颂当时的这股风气，一时间，有“妇女能扛半边天”一说。\r\n\r\n时间来到 20 世纪 70 年代。隔壁的日本战后经济达到最高潮，不仅牢牢抓住了科技最前沿，还在美国的帮助下实行了议会内阁制、摆脱了有系统性缺陷的国策。经济水平一高，人民开始设想一种新的社会现象：当生产资料不再贫乏、生产力不再掣肘发展（即任何人不再需要依靠/依附任何人存活），阶级和**群体**的隔阂有可能会消失（**改良主义马克思主义**所构想的共产主义预备阶段）。\r\n\r\n但共产主义社会要求人们具有高度的公共利益意识和自我克制精神。若人性的贪婪、自私、竞争等本质不能根除，则难以真正实现无阶级、无私有制的社会。软性制度再改进只能约束部分老实人，甚至是只能约束好人。如果政府未能正确的启发普通人，改良马克思主义将变异为**帝国主义**。此时，部分女性开始利用自己的*身体*和**政治正确**言论谋求地位提升，这为将来日本进入**失去的 20 年**埋下了伏笔。\r\n\r\n日本女性虽标榜自己独立，但事实上大部分都想不劳而获，根本无法自立。当时日本的“新时代独立”女性一般拥有四个男朋友：跑腿的、付钱的、送礼的和真爱。女方的高度物质化、功利化恋爱沉重地打击了日本适龄男性的恋爱欲望，导致经济*退行*后，日本结婚率、生育率大幅下滑。而这也导致搞笑的日本女权几近毁灭。这点我不再过多赘述，网上有很多专门说这个的，感兴趣可以自己查询。\r\n\r\n虽然男女平等是美好的，但是必然永远无法实现。最主要的因素就是生理和生产力差距。也许一个具有绅士风度的慈善家会忽略这点，但是一个利益至上的资本家不会。除非女性确实有什么让人眼前一亮的点。\r\n\r\n在资本家的眼中，谁消费，谁就是上帝。而新世纪的中国女性则按照国情和政治正确的需要，顺理成章的成为了“上帝”。2010 年前后，中国（女）人到全世界“买买买”，让西方人重新认知了中国人的购买力。能把黄金都买涨价，这是什么恐怖的消费水平？由此，为中国女性专门设计的消费陷阱越来越多。这种令女性感觉良好、体验优越的商业模式被称为**“她经济”**。\r\n\r\n由于资本家是贪得无厌的，所以女性被迫消费越来越多来获得同性比较中的“筹码”。资本家还为那些涉世未深的女性带来扭曲的价值观：如“不买就是不爱”（将婚育与消费捆绑）、“钻石恒久远”（将低价值物品炒高，并形成垄断）、“美丽密码”（引导女性为了**雌竞**过度投资自己）等。在这种趋势下，女性渐渐不能负担自己庞大的开销。她们必须寻找一个能为自己买单的人/群体。\r\n\r\n很显然，一个女性不会为另一个女性买单，因此一般男性成了她们眼中的“ATM”。她们美其名曰“放开去爱”、“女性觉醒”地去主动“追求”男性，目的是为了他们腰包里那些可怜的钱。至于同时交往好几个男朋友（或着“无缝衔接”）更是家常便饭。当这种肮脏的风气成为潮流，那么错误的事情也会被洗白。之后的几年，针对女性的营销越来越严重，甚至到了政府的一些部门都被裹挟的不得不加入这场闹剧。“忍辱负重”的女性已经在事实上凌驾于一般男性，不但只谈权利、不谈义务，还倒逼男性低头为过往的莫须有的“压迫”认错。再加上部分执法者水平有限，不能识别出一些言论的可靠性，更是加剧了男女之间的群体矛盾。\r\n\r\n这时候，**中国激进女权**（一说“中国田园女权”）已颇有当年日本女权的几分姿态。她们已将所有在古代对女性的赞美和污蔑均视作“压迫”和“标签化”，即与古代女性彻底切割。按照她们的认知，她们是不可被定义、评价、干涉的，是先进思想的代表、是共产主义真正的未来。这导致男女对立在事实上形成，而且正在逐渐扩散到全体男女。最显著的影响就是少子化、劳动力不足。2022 年，中国人口建国以来首次负增长，这被视为是中国即将进入“失去”的标志。\r\n\r\n失去了**人口红利**的中国，是否还能够“集中力量做大事”？是否还能在*领导*下实现*复兴*？这一切都还是个谜。一个基于无产阶级的政权，是否还能稳定发展？当一般男性开始认识到女性的压迫，并觉醒反抗，中国的未来会是什么？专家说，我们有“中国速度”和“中国骄傲”，但是恋爱和生育无法讲究速度。如果不想“玉石俱焚”，就必须采取积极措施救场，但总有既得利益者在尝试掩盖这场危机。也许是顶层男性，也许是底层女性，又或许根本不是中国人。这到底是一场怎么样的危机？其实答案和方案早就摆在那里，但是我们总是去忽略。\r\n\r\n人类最大的教训，就是不会吸取教训。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7c6"
  },
  "id": "incurable-disease",
  "title": "绝症",
  "date": {
    "$date": "2023-04-27T00:00:00.000Z"
  },
  "category": "随笔杂谈",
  "body": "今天偶然看到好朋友发了一条公共消息，请求捐款的那种。我以为是他家里有人遇到什么事了，但点进去发现是素不相识的陌生人。图片中躺着一个虚弱的女子，蜷缩在病床上。尽管她已经尽力尝试在镜头前保持体面，但没人能给她真正的体面，哪怕是虚假的体面，也做不到。\r\n\r\n虚弱的人，写下疲软的文字。“我们永远不知道幸福和意外哪个先来......我们是农村家庭......生病的一年来，花光家底......”\r\n\r\n这令我回想到电影《我不是药神》的片段。一个老妇双眼婆娑，几乎要以跪姿哀求警察，说着：“我只想活着，我有什么错......”当疾病真正来临，病人只能眼睁睁看着自己吃掉房子、吃垮家人，却无法道出一言。是决定活下去，但是让家人更痛苦；还是选择一死了之，给家人留下更大的自责......这时，一个模糊的身影在我眼前出现，她缓缓地走向乡下的老家，渐渐消失......\r\n\r\n求助筹款目标 30 万，却只筹到两千来块钱。诊断书和身份证毫无遮掩的呈现出来，失去的是隐私，也是苦难下的尊严。我上下划了几下，页面上信誓旦旦的说这是真实的，不存在欺骗。但我却真的希望这是一次欺骗。骗我一次，也骗上天一次——将他们的病痛遗忘。\r\n\r\n我可以选择也献出爱心，但我知道这治标不治本。只因为我们的医学技术再先进，也治不了一种绝症：穷病。\r\n\r\n朴实的人，写下无华的文字。“......我也不愿意麻烦别人，思量再三，无奈发起了筹款，还请大家帮帮忙！”\r\n\r\n我翻看着捐款列表，有那么多她素未谋面的爱心人士伸出援手。他们也许并不图病人和家属的感谢，也许并不是为了完成某项任务。我相信他们真的是在积德行善——以纯洁的、善良的心来做这件事。\r\n\r\n我当然也可以选择成为这样的人。但是我犹豫了。我不知道我为什么要帮助她和他们，哪怕是他们会真的郑重感谢我。经过社会的打磨，我的心似乎已经不再温暖。我就是吝啬这几块钱，就是不想捐给她。而且即便不捐也不会怎么样，没有人会指责我——不像以前班级内“自愿”募捐那样。我宁愿省下来这些钱买瓶可口可乐、买瓶促销装脉动，也不愿意“白白扔掉”。\r\n\r\n我狠心离开页面，但页面又问我是否要帮助别人。点“是”，又是另一个即将破碎的家庭：孩子全身插满管子，依靠着呼吸机苟活着。连续看了好几个页面，我倍感无奈。事实又一次印证了“家家都有本难念的经”。\r\n\r\n这天下的难人救不完，如果每个都去救，谁会来救贫穷的我？我再次狠下心来，彻底退出了界面。彼时，我羞愧不已，我的良心在拷问着我。可我无法回答，只因我也早就患上了这种绝症：穷病。\r\n\r\n我很抱歉，请当我从未来过吧......"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7c7"
  },
  "id": "ue-ux-by-talk",
  "title": "堪用、易用、好用——人机交互杂谈",
  "date": {
    "$date": "2023-04-16T00:00:00.000Z"
  },
  "category": "技术参考",
  "body": "2007 年 WWDC，乔布斯向世界介绍了初代 iPhone（手机）。它的正面只有一块巨大的触摸屏和一个“Home”键，并且不对屏幕配备手写笔。对此，乔布斯这样说：\r\n\r\n> Who wants a stylus? You use it and lose it, yuck! Nobody wants a stylus. So let's not use a stylus. We're going to use the best pointing device in the world.\r\n\r\n而这个最好的设备就是手指。尽管 Apple 不是第一个提出手指触控的概念的公司，但是是第一个将其变得十分好用并推广开来的公司。你能看见的，就可以用手指去轻触来获得/到达。这彻底颠覆了当时市场上流行的愚蠢的交互逻辑：你能看到的，必须用方向键或虚拟光标来获得/到达。\r\n\r\n于是，一切发展成了我们熟知的样子：之后的手机基本没有再采用实体键盘设计的，取而代之的是一块巨大的触摸屏。2016 年，小米又向世界介绍了小米 MIX，首次推广了“全面屏”的概念。于是现在的手机连“Home”键或“三大金刚”键都没了，只剩一块几乎挤满正面的屏幕。而我们对此已习以为常。\r\n\r\n手机交互为什么会有这样的发展趋势？从按键控制，到所见即所得，再到“一手全部掌握”。从这种过程中，我们发现用户会选择更直观的，而不是更机械、精确的交互方式。按键确实算得上精确，因为你按一下就是位移一个单元，一毫米也不会多；相比之下，触控就差得远了，你有的时候想点一个东西，而由于手指按的不太准，可能就变成了按另一个东西。这种模糊的、连续的（与“离散”相对）定位方式，非常符合自然界/日常生活的实际情况：有的东西差一点就有可能是谬之千里，但眼睛所看见的是非常直观的，不需要多动脑子。因此用户会选择这种方法，也不足为奇。\r\n\r\n而在 UE/UX（用户体验）设计中，我们把这种直观的交互称为“好用”。用户体验，就是我们在使用一款产品或系统之前、使用期间和使用之后的全部感受。包括情感、信仰、喜好、认知印象、生理和心理反应、行为和成就等各个方面。UE 所体现出来的意义是以人为本的原则，多从用户方面考虑，才能让用户产生良好的设计体验。在人机交互的整个主题之下是这样一种信念：使用计算机系统的人应该排在第一位。他们执行各种任务的需求、能力和偏好应该指导开发人员设计系统的方式。人们不应该为了适应系统而改变他们使用系统的方式。相反，系统的设计应该符合人的需求，即**用户中心设计思想**（User-Centered Interaction Design）。\r\n\r\n那怎么快速判断一个东西好不好用呢？简单，当你不需要说明书就能猜到怎么用（前提是你从来没用过）时，它就算非常好用了。比如一把菜刀、一根打狗棒，总比一把枪、一架迫击炮更顺手。\r\n\r\n而一个光看着就感觉很复杂、精密的系统，很显然就是“堪用”的。虽然现实世界也是逻辑复杂的，但永远不会体现在表面，那些逻辑都是靠我们自己想象出来的。因此一个交互不应该是繁文缛节、条框甚繁的。如果用户使用前还需要专门翻一下说明书，那 UE/UX 设计简直就是失败无比。比较常见的有各种工厂里用的工控机。它们就是把各种功能都搞得十分复杂，不经过专门培训根本就不可能学会用。又比如一些生产力软件，界面设计的很复杂，按钮们叠在一起，令初学者望而生畏。\r\n\r\n如果我们都把产品设计成普通人不敢学、不愿意用的样子，那产品还有什么存在的意义呢？\r\n\r\n我认为，一个产品必须要拥有友好的界面和完善的操作指引，才能称得上“易用”。比如计算器，它将所有数字和操作方法列在一个界面上，你只需要根据需要将它们组合在一起就可以了。要实现计算 1+1，就分别按下“1”、“+”、“1”、“=”就能得到结果。所有元素都是可以直接看见的，而且组合顺序上也跟我们在纸上书写是一致的。\r\n\r\n而现在 AI（如基于 LLM 的 ChatGPT）已经能够做到你口头问它问题就能给你详细讲解的地步了。比如问它 10 的阶乘等于什么，它不仅能直接告诉你结果，还能告诉你过程和用到的相关概念。因此 AI 也被视为下一代人机交互的突破口。你操作机器，就像现实中命令下属一样简单直接。\r\n\r\n之前做过了不少项目，我在这方面深有体会。用户的需求是五花八门的，你不能期望把它们都列在一个狭窄的界面上。因此要么只展示重要功能，要么实时分析用户的需求并尝试实现。因此，现在国内大力发展 AI 是不无道理的。\r\n\r\n笔者认知有限，无法讲出更多深奥的原理。但是这是一个初级从业者对人机交互的朴素认知，某种程度上还是能考虑到一般用户的。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7c8"
  },
  "id": "bye-bye-past",
  "title": "再见了，旧时代",
  "date": {
    "$date": "2023-04-09T00:00:00.000Z"
  },
  "category": "随笔杂谈",
  "body": "人生的路途像乘坐着旅游大巴。窗外的风景有时会让我们感到无聊、昏昏欲睡，有时又只是一瞬，便能让我们回味无穷。是哭是笑，都只是一时的品味。若已经错过了太多站，又何必再多沉浸于过往的烟云。\r\n\r\n自从某一刻开始执行“Elite Project”，我就开始有意筛选周围的人：什么人是“有效的”，什么人是“无效的”。拒绝滥交才能提高办事效率，我始终坚信。身边的教训在不断地印证我的策略——各种各样的，因为维护人脉、与所有人尝试交好，甚至是讨好，浪费了大量时间与精力，深受其害。\r\n\r\n因此，我疏远、拉黑、删除、躲避他/她们。像洪水猛兽前的小鼠，战栗着、厌恶着——他人之蜜糖，我之砒霜。有女生示好，我会判断这背后的经济利好；有男生搭话，我会猜测其居心到底如何。渐渐的，我不能再相信任何陌生的人。我作茧自缚，将自己永远困在这孤独黑暗的茧房中，不与外界沟通。现实中的笑脸相迎和侃侃而谈，只是护城河呈现出来的绚丽罢了。\r\n\r\n此外，我对于熟悉的人，也开始敏感起来。当他人开玩笑时，我无法分清到底是威胁、愤怒，还是调侃、善意。如果发给一个人消息，他短时间没回，我也会感到负面情绪如排山倒海。长期的内耗让我濒临崩溃，心理变得十分脆弱，尤其是面对熟悉的人时。一些风吹草动就会让我感到不寒而栗。\r\n\r\n我知道我早就已经病了。是严苛的病，是固执的病，是烧尽生命之蜡烛的病。要想获得救赎，就要从自己身上先开刀。我尝试不再孤僻、拥抱大众，但得到的只有无尽的冷脸与满不在乎。无穷的付出换不来回报，我又开始心灰意冷了。\r\n\r\n我为什么会那么在乎我的朋友们？是人的群居性使然吗？不，我认为是我自身太过于热情（*白羊座是火相星座*），抱有太大的期望。当对方没有达到期望，则自然令我倍感冷落。可热情和真诚是我的本性，我不愿意因为环境而变成麻木的人。因此我开始遴选值得这份热情的人。\r\n\r\n与早期的计划不同，我开始向陌生人主动示好，再根据互动判断是否值得交往。但我又忽略了一点：人是会变的。曾经的挚友，分开只消一年，就可以完全成为陌生人。见面不打招呼，甚至绕着走——还不如陌生人。突然失去共同话题却只能强撑着维系，有一句没一句地不断搭话，稀稀拉拉的聊天记录好像伤口流出来的血。\r\n\r\n滚烫的静脉涨破我的眼球，我不由得迸出伤神的泪。这时候应该沉浸在过去的挫折中吗？这时候应该无所事事独自悲伤吗？应该坚强起来，挥泪斩断羁绊。\r\n\r\n![](https://pic.imgdb.cn/item/64d1d4dc1ddac507cc6b4d83.jpg)\r\n\r\n充实自己吧！提升自己吧！将自己带到一个新的水平，才能遇见更多值得的人！\r\n\r\n这么想着，以前的好朋友突然发来消息，问我要地址。我一愣，他要做什么？我从未设想过有人能记住那一天，因为我已经是受尽了孤独的人，度过了每一个没有人记得的春天。虽然一切已经是昭然若揭，但是我仍然压抑住兴奋，乖乖的交出了地址。顷刻间，阴霾散去，我又有了积极下去的动力。\r\n\r\n打开电脑，戴上耳机，码好键盘。属于我的工作时间又要开始了！前进吧，活泼的中二少年！就用这股力量，向过去再一次的说再见，永远向前眺望。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7c9"
  },
  "id": "lbs-comment",
  "title": "Sony Linkbuds S 简评",
  "date": {
    "$date": "2023-03-18T00:00:00.000Z"
  },
  "category": "技术参考",
  "body": "我原先用的 Sony WF-1000XM3，市称降噪豆三代。但是这么多年过去，它已是廉颇老矣。要 LDAC，没有；要 TWS，没有；体积与现代蓝牙耳机格格不入；电池也崩的差不多了。在这种背景下，我迫切寻找一个新的替代品。\r\n\r\n最稳妥的选择，当然是上“降噪豆四代”（WF-1000XM4），但是上网一搜评测，铺天盖地的控诉品控爆炸。总结一下，就是说这玩意初版固件写的有问题，耗电特别快，半年就能把电池折腾到报废。21 年年中发布的产品，到 22 年年末才 OTA 修复。那么在市场上想买到未受到波及的产品，就只有买新货（899r）。但在预期中，我是想到海鲜市场里淘一淘，从 JD 买的话，成本就太高了。\r\n\r\n这时，另一个替代品走入视线：Sony Linkbuds 系列。LB 系列是索尼在 2022 年新推出的系列，原则上也属于 WF 系列，其中 Linkbuds 创新的使用了环形发声单元，晚些发布的 Linkbuds S 则是重回传统入耳设计。网上很多人都在推荐后者，说虽然是次旗舰，但是比老大哥不知道强到哪里去了。也许是大伙对 XM4 的表现很失望，或者是 LB 系列确实品牌税太低，所以才造就这种认知偏差。\r\n\r\n经过一顿暴力压价，600r 拿下白色 95 新单机。三天后，刚到货我就迫不及待地使用起来。首先是外观，通察一遍只有底部有一点瑕疵，耳机舱内部有点灰，其他没啥。按照指引连接到宿主设备后，打开 Sony Headphones，各项配置拉满，然后狠狠播放 bass の小曲：\r\n\r\n用不了几秒，左耳直接断联了。\r\n\r\n在固件更新 + 充满电后，还是有一定几率在各种场景下抽风。我一开始怀疑是 LDAC 的问题，但关掉之后仍然有这种问题，尤其在连接到手机上时比较明显。只有每次重新配对才能连接的比较稳妥，否则就是看脸。之后我又连接到笔记本（AX210）上用，就基本没触发过，但是还是有几次是抽风的。也许是手机的问题，但是控制变量法显示应该还是固件的锅，因为我之前用降噪豆三代从来没遇到过这样的问题。索尼，只会堆料，不好好做软件啊，别跟移动部门学坏了。\r\n\r\n说完明显的缺点，再来谈谈不太明显的问题。耳机自带三个环境模式：降噪、通透和不作为。软件上我屏蔽了不作为，因为感觉没啥用。降噪相对于 XM3 不上不下，感觉没有太大的优势，毕竟体积放在这里、定位摆在这里，我也能接受。开启 5 成音量时，播放 hardbass 流派的音乐，对于宿舍里的粉红噪音和普通对话，是可以基本忽略掉的。通透做的那就是一塌糊涂了，绝对是远远不如 XM3 的，环境反馈给的太多了，导致有一种嘈杂的感觉。若环境的高频信号太多，则容易反馈为更高频，听起来有一种刺耳的感觉。\r\n\r\n调音方面，老传统了，你要是敢用它自带的 SFX，那就是超级糊；至于 DSEE，那更是瘠薄用没有。所以老老实实的听“原始”，就行了。\r\n\r\n合着这是从内到外没一点好了是吗？也不是，LBS 有更小的体积，便于携带、运动时配戴更不容易掉；软件上支持 LDAC，让无线 Hi-Res 成为可能，当然了，木耳可以忽略这点；然后就是卖的比 XM4 便宜。不过现在无论是 JD 还是小黄鱼，它俩差价都是可以忽略的了。\r\n\r\n总结一下，LBS 在一定范围内确实槽点多多，只能说索尼刀法已经是练得相当精湛，千元级不给配无线充电就算了（XM4 有），基础功能都做的稀烂，属实不太称职。但同价位，LBS 绝对是神一样的存在，兼顾了音乐和通话，还有信仰加持（屁用没有）。实用性上，跟 AirPods 2 掰掰手腕那都是洒洒水啦，对于同/低价位的国产 TWS 那更是超级爆杀。如果你是一个注重时尚和移动体验的人，那么索尼这边可以选 LBS；如果你是追求极致音质、经常坐着/慢走时听的人，请选择全新的 XM4。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7ca"
  },
  "id": "perfectionist",
  "title": "完美主义者的自我修养",
  "date": {
    "$date": "2023-03-16T00:00:00.000Z"
  },
  "category": "随笔杂谈",
  "body": "昨天认真看了《孤独摇滚》前几话，我开始反思我自己。\r\n\r\n孤独的路，是怎样该被定性的一条路？是一条与大众背道而驰的路，是一条无人认可的路，又是一条能够于绝境中反转的路。但是我感觉我已经前进了太久，略有疲乏——干不动了。\r\n\r\n看到惨淡的成绩单，我知道一切是有点心有余而力不足了。但我还有很多事情得做，压得我喘不过气来。这也要学、那也要练，怎么会有那么多事情？我痛恨我自己是一个完美主义者，把一切弄得太难、把自己弄得太狼狈。这种逼疯人类的高标准，是否对我来说是合适的？\r\n\r\n要不要放松一下？要不要停滞一下？我的心在悄悄问我，但是我置之不理，使其奔跑在高速轴带上。为了躲避这“劳役”，我开始假学习、忙里偷闲。但这既浪费了时间，又没把事情给办好。\r\n\r\n说真的，我必须沉下心来，认真求学。调整自己的态度，越是着急就越要尝试镇定。像曾经的乔布斯一样，完全投入身心到事业中，抛却身边尘俗的花花草草。一个完美主义者，如果不能践行自己的要求，就是不合格的、注定要被淘汰的。\r\n\r\n今天老师又找到我，问我关于科研/独立项目制作的事情。我一下子回过神来，这本来该是我的主业，而现在连这点，也快要被忘记。然后便是一堆“之乎者也”，什么 Vue、什么 Django 的。我一下子蒙了，自以为豪的原生技术三件套瞬间不香了。现在市场根本不用原生，都是用各种集成框架、服务。而我，想要达到应用水平，还差很多——甚至是，一窍不通。\r\n\r\n有需求，就有动力。怎么能说自己精疲力竭？怎么能够自甘堕落？跟将死之人一起玩游戏浪费时间？快醒醒吧！学习其实是终身的事情，不存在学完，也不存在边学边玩。等待，就是埋葬自己。\r\n\r\n此外，[MDHu Project](https://penyoofficial.github.io/mdhu-project/) 该办还得办，没人听是别人的事情。能因为没人关注就放弃吗？这种追求、爱好的事情，也不存在功利一说，自己的价值此时是可以由自己决定的。\r\n\r\n所以，别再沉沦、别再嬉戏。平庸的永远是大多数人，你跟他们一样，就是选择成为这样的人。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7cb"
  },
  "id": "72h-hell-experience-quickpass",
  "title": "72小时地狱体验速通",
  "date": {
    "$date": "2023-03-14T00:00:00.000Z"
  },
  "category": "随笔杂谈",
  "body": "春季来了，是流行传染病复苏的绝好时机。\r\n\r\n在普通流感与特化流感（甲流）的双重夹击下，借着一场超越星辰的鏖战，开学以来最难蚌的事件即将发生。\r\n\r\n一开始只是淋巴结肿大、颅内血压高，我不清楚是怎么了。上网一查，有说什么炎的，有说什么癌的，吓人一跳。不会我年纪轻轻就因为熬夜寄了吧，跟新闻上报道的案例一样。\r\n\r\n室友劝我去医院看看有没有什么毛病，要是真有什么大病，早发现早治疗......我连忙打断，止住！虽然不排除这种可能，但是我还是希望是虚惊一场、是一场小病，毕竟我还有很多事情没有完成......\r\n\r\n晚上，我躺在床上，久久不能入眠——脑子里剧烈的疼痛侵蚀着我的意识。疼痛像蚕虫一样，一点点啃食我的眼球和大脑皮层，我知道“它”在哪里，但是我无能为力。只能祈求明天一睁眼就是新的一天。\r\n\r\n但祈求不灵，第二天变得更差了。全身快速显出大量红点，而且它们有的疼、有的痒，分布在各个部位，这下可是真的狠狠折磨了。这又算什么？由什么引起的皮疹？我胡思乱想着，回想起室友的催促，便再也由不得我自己，赶紧就医！\r\n\r\n骑着室友的粉红电动车和他不知道怎么想的买的粉红头盔，配着我“恰恰好”挑选的粉红衬衫，我摆出个臭脸在路上奔驰着。迎面而来的，是久违的略有炙热的日光，和罕有的空旷的道路。一切像载入不了 NPC 的崩坏游戏存档，显得十分怪诞。\r\n\r\n本来是打算只去社区医院的，但是由于我笨，没找到在哪，于是决定去“市一院”。打开导航，我感觉又回到了高中：面向未知的面交地点，勇气开满前往“交易”！但这次略有不同，是以“有价”易“无价”。\r\n\r\n由于是来合肥以来第一次就医，我愣是没找到入口在哪，转了半个小时才找到。虽然明明就是地铁施工队乱截路造成的，不怪我捏。由于从错误的地方进入（侧门），所以一开始我甚至没找到在哪挂号，只见一楼阴森无比，所有窗口紧闭，里面灯也不开，纯靠落地窗那点可怜的采光。\r\n\r\n我壮起胆子进去，看了眼像挨了一枪似的瘫在公共长椅上的保安一眼，蹑手蹑脚溜了过去。上网查了半天，就是查不到医院的地图，根本不知道我要去哪。但是我又不好意思问人，他们一开口就是南不南北不北的方言，根本听不懂。\r\n\r\n![](https://pic.imgdb.cn/item/64d1d4dc1ddac507cc6b4e8e.jpg)\r\n\r\n好巧不巧，手机还给我推广告，问我要不要在线有偿就医。哈？我都到这儿了，我还......不行，今天我还非在这治不可了！——几分钟的闲逛后，我终于找到了主楼，按照指示挂上了号。\r\n\r\n由于主楼内标识基本完备，我很快就到了科室门口等候。经过将近 100 分钟的等待，终于轮到咱了。结果医生看一眼就说这是水痘，开了药，直接给我打发走了。啊，果然还是专业人士经验丰富，比我搁那瞎想强的多了。然后院内再走走流程，就可以回去了。\r\n\r\n挨到晚上，我艰难的拿着涂剂，抹在患处。此刻，我感受到这个晚上无比漫长——水痘又痛又痒，可我既不敢抓，又够不到来抹药。我脱光衣服，坐在椅子上，独自感受瘙痒的折磨。朦胧的月光透过安全窗，嘲讽着我的无能。这时，我突然开始渴求健康，原来平日里常见的东西一旦缺失，人便立刻感到痛苦。我不知道我是怎么熬过来的，但是下一次睁眼，来到了次日。\r\n\r\n身上的皮疹变得更多了，部分开始结痂，有的顺便排出油脂。脸上是最严重的，本来脸上还算干净，这下彻底成了一张“烧饼”，惨不忍睹。同时头更疼了，我知道这是免疫反应达到顶峰，但是还是有点烦躁。如不出所料，这一天也荒废掉了。\r\n\r\n来到第三个出疹日，身体痛感基本消失。但是疤痕布满全身，卖相极差。用手用力拂过，连皮带肉剥落下来，令人感到一阵恶心。好在是不再出新的水痘了，这标志着已经看到康复的曙光。好好好好好，感谢医生，感谢盐酸伐昔洛伟，这辈子最好别再见！"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7cc"
  },
  "id": "20th-anniversary-prospect-2",
  "title": "二十周年前瞻：摒除干扰，学，然后致用",
  "date": {
    "$date": "2023-02-28T00:00:00.000Z"
  },
  "category": "随笔杂谈",
  "body": "我从来都不否认一个观点：应用是工程学的终极目标。因此当我选择了工学，就是选择了“使用”、“实用”的学问。\r\n\r\n现在我自以为我已经知道如何利用现有技术来开发简单实用软件。如果有实现不了的需求，那我就去现学现用。且我不在意以后学了更前卫的技术之后再翻写现有的版本，毕竟人是要进步的，而练习是进步的必要条件。总想着到了一个“顶点”再出手，那就是纯粹的眼高手低了。\r\n\r\n再多的说教终究是没有亲身体会来的印象深刻的——尤其是在人生策略上。只有高度统一理论和实践才能使学习过程有效。我能看见身边有很多人，他们也是一样的学习（专业课），但是就是老将其视为一块硬骨头，不愿去啃，光觉得舔到味就行了。没有关系，考试会出手。你背得了一时，背不了一世。\r\n\r\nIT 行业最不缺 IT 民工，它们消耗自己的生命健康，来换取行业里最低的工资。这种耗材，年年都有，从各种各样的带专和普本里倾盆而来。什么时候你干不动了，就用更内卷、更廉价的年轻劳动力取代你。这就是没有真技术的IT人的下场——绝大多数人。为了避免成为可以被随意取代的人，我不得不提前开卷。\r\n\r\n市场需要什么？企业需要什么？正在流行的产品用到什么技术？再问深点，你学这个专业是为了什么？你将来能因为学了这个专业干什么？你认为你相对于你的 985/211 竞争者，有什么优势？我这么问过我自己，于是知道现在该做什么。未来走的路，并不是要等到脚沾地才开始铺。人应该针对未来所要面对的一周、一年、三年等时间段设置不同级别的目标。\r\n\r\n低等目标用于指导基础事件的进行，它们是能力建设的必要贡献；高等目标用于设计未来发展可能的应对方案，小到职业、大到“人生大事”，都需要提前设想它们的可能性。\r\n\r\n我对消费级软件开发很感兴趣，所以我知道我要先学习基础技术理论，再尝试做几个项目锻炼一下。如果能加入一些研究生的项目，或者参与一些比赛，那是更好的。有人会觉得这是浪费时间，但是时间放在这样的事情上，我觉得并不算浪费。什么是浪费时间？一个宿舍每晚组团开黑算不算浪费时间？在社交软件上疯狂求偶发情算不算浪费时间？到二次元社团里天天发癫算不算浪费时间？\r\n\r\n所以我认为我做的事情更有价值，且远远超过身边人的。学习，或者竞争，并没有什么“携手”可言，我也没有任何责任帮助、点明、“拯救”别人。他们选择做什么，是他们的自由。我选择每日鏖战，也是我的自由。\r\n\r\n我从学习中获得低阈限的快乐，从实践中获得中阈限的满足。这种朴素的娱乐就是我自愿获得的全部娱乐。而更大的刺激在我看来，就是毒品。你一旦沾染，就无法再挣脱，越来越依赖、越来越无法沉得下气来。\r\n\r\n而这正是一个古典求学者该有的态度。摒除干扰，学，然后致用。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7cd"
  },
  "id": "customized-kbd",
  "title": "好好打字，爱上打字",
  "date": {
    "$date": "2023-02-24T00:00:00.000Z"
  },
  "category": "技术参考",
  "body": "键盘，作为重要的计算机输入设备，已经活跃了近百年。直到现在，我们还不能找到一种办法能够取代传统打字，虽然语音输入曾尝试分走半壁江山，但是市场最终没有选择它——因为这对普通话不好的人来说，太不友好——尤其是对我的父辈来说。对一个字不好抱有确定的读音，或者说确定，但不是普通话，都会遇到不小的阻碍。除了 Gen-Z 基本都能说一口流利的普通话，20世纪出生的人大多都得经过专业训练才行。\r\n\r\n那么手写输入呢？说实话，并不是每个人都接受过高质量的教育，期望他们写出一手能让机器认清的字，不太现实。更何况，手写输入效率太低，一分钟能写 30 个字都已经是极限，对于我们刻板印象中爱用手写笔的商务人士来说，还是太慢了点。\r\n\r\n因此，我们没法抛弃英文键盘或者五笔键盘，这既是市场的选择，也是时代的选择。五笔打字曾经风靡一时，被誉为输入汉字最快的解决方案，为什么现在却落寞了呢？我猜是因为要额外学习，输入汉字并不严格按照笔画顺序，也就是得“死记”、不够直观。或许专业的打字员会花时间去练习，但是大众不会。所以以**现代汉语拼音**（现代汉语拼音完全契合拉丁字母集，摒除了可能用到的欧洲字符）为基础的拼音打字法最终占了上风。你只需要知道字怎么读，并了解其拼音，就可以把字打出来。后来随着模糊匹配算法不断成熟，用户哪怕输入错误或不完整的拼音，算法也能根据上下文纠正、补全。如*银行*（yín'háng），你打 *ying'hang* 或者 *y'hang* 都能匹配到目标。\r\n\r\n可以说，现代汉语拼音是汉语与西方世界沟通的桥梁。建立起汉字到拉丁字符序列的映射，是无比天才的发明。\r\n\r\n而键盘作为承载的工具，则是功不可没。从小到大，我摸过最多的键盘，就是一块小小玻璃——手机中的虚拟键盘。它默认是 26 键的，经典的 QWERTY 配列的。这也是我为什么对“九键方案”那么陌生。由于小时候家里没有桌面 PC，因此惟一能摸到的实体键盘就是笔电上手感稀烂的**薄膜键盘**。想摸到其他键盘？那就只有好运的时候，到学校机房里、父母单位里、朋友的家里，去体验一下另一把**薄膜键盘**。\r\n\r\n当你在一把薄膜键盘上打字时，你会发现每个键都是那么的绵软无力，像 17 世纪南美黑奴采摘下来的棉花，或者你乡下的远房亲戚过年的时候送你的虎头鞋鞋垫。它逆来顺受，比春晚里怕老婆的郭冬临还蔫儿，你哪怕用尽气力攻击回车键——一把键盘的灵魂所在，键盘也只会发出弱弱的塑料碰撞声。就算是让一个饱含激情的文字工作者来用，他也会很快睡着。若当它恰好又来自于几年前的笔电或者淘宝九块九专区，那简直就相当于把手放到公共食堂的泔水桶里乱搅一通——恶心极了！\r\n\r\n因此，我的选择是买一把个性鲜明的机械键盘，且我在上大学后三个月内就确定了要买哪款。不同于高中时期的客制化，这次我选择从既有产品入手，再加以改造。一把达尔优 EK861，它拥有 61 个按键（全配列是 108 键，是最普遍的），因此看上去小巧可爱。**红轴**作为知名的线性轴，对长时间码字非常友好，同时不失美妙的手感。由于键盘本身不支持**热插拔**，因此我唯一能动“手脚”的只有键帽。这一点遗憾，也为之后进一步深入客制化埋下了伏笔。\r\n\r\n![](https://pic.imgdb.cn/item/64d1d4dd1ddac507cc6b50e7.jpg)\r\n\r\n后来，我收了一把二手青轴键盘，在修复翻新的过程中，我掌握了大量相关的理论知识和实践技巧。翻新完成后，我重新产生了对深度客制化键盘的渴望。毕竟作为 IT 行业从业人员，一把好的、深得我心的键盘，能在一定程度上提升我对学习工作的激情......\r\n\r\n现代意义的客制化键盘主要由三部分构成：底座、轴体和键帽。底座主要包含 PCB（是否支持光效、热插拔、键线分离？）和外壳（纯色还是半透？）；轴体是机械键盘的核心，分为段落轴（普遍更响、声音较脆）和线性轴（普遍更好按、声音较肉），现在国产轴百花齐放，建议不用盲目崇拜樱桃轴；键帽按材质分为 ABS（容易**打油**，现在只能在低端键盘上看见）和 PBT（未来趋势，且易于热升华印刷），花色什么的纯凭喜好。\r\n\r\n前几天，我最终敲定了新一期客制化方案：狼派 CIY Tester68 底座 + LEOBOG 灰木轴 V3 + 马里奥风 OEM 高度键帽。这套方案按市场常价只花约 190，努努力压到 150 也不是没有可能。键盘采用两节 AAA 电池串联供电，由于没背灯，可提供长达 20 天的续航。好巧不巧，之前折腾手柄的时候买了一些**镍氢电池**，所以电池这块基本不用花钱。连接上支持 2.4GHz WLAN 和蓝牙，不支持有线，WLAN 模式下大概十几键**无冲**，打字完全够用。\r\n\r\n灰木轴主打“麻将音”，是一种非常讨喜且不太吵闹的轴体，是近两年非常流行的一个分支。这几天我用下来体验相当好，触发起来很容易、打字较为省力。如果手指离键帽较远，下落打字时，轴体有一种清脆的声音，如果贴着键帽打字，就是纯纯的麻将。我尝试采样后降噪处理，听起来有种 ASMR 的感觉。\r\n\r\n这篇博客就是用这个键盘打出来的，整体行云流水。我感觉用了它有一种魔力，让我更爱打字，能写出更多有创意的语句。而这，也是客制键盘的精髓所在——爱上你的打字工具，好好打字，爱上打字。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7ce"
  },
  "id": "luxuries-the-laptops",
  "title": "摇摆的“奢侈品”——笔电",
  "date": {
    "$date": "2023-02-23T00:00:00.000Z"
  },
  "category": "技术参考",
  "body": "1982 年，美国康柏推出了世界上第一款笔记本电脑的雏形。它拥有当时计算机该有的输入输出单元，同时一切集成在28磅的“轻薄”机身中。1985 年，日本东芝推出 T1000，第一次给人们带来了笔记本电脑的概念。从此，笔电在轻薄化、低功耗（也意味着低性能）的路上越走越远，与传统桌面 PC 市场割裂开来。\r\n\r\n时间进入 21 世纪，一切都在飞快的变化着。上世纪末霸主 IBM 将 ThinkPad 卖给联想，将未来赌到云计算上；NEC、东芝等日本厂商受到美国压迫选择明哲保身；国内个人计算机厂商开始尝试异军突起......这段时间 PC 市场的竞争是最激烈的，国内 DIY 市场也因厂商价格战进入巅峰期。彼时，笔电还是少数高收入群体的玩具，根本无法普及，只有有强烈移动办公需求的商务人士才会购买。且当时的笔电性能低，根本不足与性价比高的桌面 PC 所竞争。\r\n\r\n2011年，英特尔酷睿二代上市。这是首次将 CPU 和 GPU 集成到同一个die上，意在彻底淘汰板载 GPU（一说集显）：PC 市场进入核显时代。以台厂为首的传统 PC 厂商推出相应的笔电产品，笔电流行热浪立刻席卷全球。2016 年，英伟达推出 GTX1000 系列 GPU，先进的帕斯卡架构使得本世代升级跨度赶超任何以往，搭载了相应产品的笔电终于能一探高画质大型游戏，游戏本从此站稳脚跟，笔记本也丢掉了鸡肋的帽子。2018 年，八代酷睿的推出更是巩固了这一事实。\r\n\r\n2018 年还有另一件大事：数字货币大范围兴起，桌面 PC 被大量用于区块链计算，配件价格水涨船高，最贵的时候一条 D4-2133 8GB 的内存条能突破千元（相比之下现在只要不到 100 元）。这沉重的打击了桌面 DIY 市场，大量用户转投笔电，桌面 PC 市场正式进入寒冬期。\r\n\r\n由于笔电大量出货，笔电价格也渐渐走低，彼时只需 5000 元就能买到一台合格的办公本，笔记本在中国真正实现了走进千家万户。再加上大厂纷纷下海血拼性价比价格区间（如惠普的暗影精灵）、小厂（如机械革命）为了口碑也走“小米模式”，物美价廉成为了笔电的代名词。\r\n\r\n但好景不长，同年 9 月，英伟达发布 RTX2000 系列 GPU，首次引入硬件级光线追踪运算单元。PC 游戏正式进入“光追元年”——这被视为摩尔定律失灵后，传统硬件厂商“无中生有造需求”的首次挣扎。当半导体制程难以进步，新一代产品吃不到制程红利时，怎么才能吸引消费者换代呢？除了联合软件厂商提高硬件占用率（后来证明是失败的）、提升底层电路运行效率（极其困难），已经别无他法。\r\n\r\n2021 年，史上最大的“矿潮”横扫全球，民间 DIY 市场基本死亡。大量投机“矿老板”高价垄断计算机配件——连笔记本都无法幸免于难。笔电价格再次回高，当时国内一台搭载了 RTX3060 的某一线品牌笔记本甚至要价 10000+。某些“高端”厂商为了趁机大发横财，甚至不惜拉下脸推出所谓“二次元风”产品——真正的赛博答辩，卖给人傻钱多的睿智大学生。\r\n\r\n这种疯狂的现象也吸引了上游厂商开发专门的“挖矿”硬件（抢生产线），再加上 COVID-19 干扰正常生产，国内外基本上不可能平价买到电脑。直到次年 9 月，以太坊官方禁止 GPU 参与运算，这场长达两年的闹剧才停止。国内则是又额外“坚持”了好几个月，毕竟商人们可不乐意高价囤的货烂在手里。于是，当时“空中飞人”和“天台排队”是玩家对奸商最美的祝福。\r\n\r\n2023 年年初，CES2023 为世界带来了多款新品，其中就不乏搭载了 13 代酷睿 /7 代锐龙和 RTX4000 系列的产品。但价格多虚高，且短时间内难以进入国内，因此没掀起什么波澜。直到 2 月 14 日，机械革命宣布 4060 卖 5999......国内玩家才再一次看见希望，大呼机革良心。\r\n\r\n我也趁机抢到了第一批 5999 的 4060——神州 Z8D6。\r\n\r\n![](https://pic.imgdb.cn/item/64d1d4dc1ddac507cc6b4f57.jpg)\r\n\r\n配置我就简单提下，还算看得过眼：i7-12650H（相比于 12700H 去掉两个能效核，核显也阉割了单元）+ 4060（140W 满血，但是是 AD107），16GB D5-4800 单条（单条好文明！！！），512GB PM9A1（已自行换成 1TB SN850X），2560x1440 165Hz 8bit 100%sRGB 15.6'' 屏幕，键盘静态 RGB（为什么没有动态光效？），7铜管梦幻散热。软件上支持独显直连，到手直接切换；接口有 3A1C、1HDMI、1miniDP、1RJ-45和音频输入输出接口。\r\n\r\n系统原始为 Win11 22H2 家庭中文版，不送 Office（装的 365），换硬盘后装 22H2 专业工作站版 + MS365 + 骗数字门票。游玩 Apex Legends 全高画质（2.5K 分辨率）帧数在 100-110 左右，MS 自家的奥日 2 和地平线 4 全高都能跑满，这个算是符合预期。打开 PS CC2022 从载入 Loading 窗口到进入工作界面约7秒，AU 不到 1 秒，PR 约 4 秒。性能其实没什么可担心的，到了现在，日用的性能都是溢出的。所以这方面我就不多测试了。\r\n\r\n接下来来说一些不足。一是装完机系统不会自己打驱动，估计是神舟 BIOS 里没把硬件型号写清楚，汤姆的 AX201 都认不出来，还得我用老电脑去官网自己下载（官网还不支持一键下载，差评）再拷过来装（RJ-45 和 USB3 一开始也不认！）。二，全身塑料的强度太低，我在宿舍用的时候，电源适配器的钢插头掉到 C 面上（不到 10cm 高），直接砸出来个坑（心疼死我了）；几天的使用下来，屏幕面直接形变了，虽然稍微扳回来一点就平了，但是还是有点膈应。三，接口位置奇葩，RJ-45 放右边，C 口放后面，我都不知道设计师怎么想的，关键后面的 DC 还和视频 IO 打架。\r\n\r\n当然，5999 了，还要什么自行车。没有 Windows Hello？密码多安全！只有 M.2 位 + 一个 2.5'' 位？我不用主从盘策略！D 面下面没有防尘绵？我清灰特别勤！这个价格出了任何问题，我自己就是售后。那些高价买了答辩的，用不着到我这里来酸——没用。更何况它还有一键关闭显示屏、超大触控板、双扬（凉拖答辩，但聊胜于无）等令人惊喜的小特性，我实在没法对它有任何严苛的批评。\r\n\r\n也许是时代的晕染，我们都习惯了高价答辩，出现一个平价好物就趋之若鹜。殊不知，这就是它本身该有的正常价值。什么时候电脑成为了一种奢侈品，普通人非但没有从科技的进步中获益，还被资本家狠狠恶心。5999 的 4060，说不上便宜，但是在几个司马“一线”厂的哄抬下，我们居然下意识准备好了八九千块钱来迎接它。从来如此，便对吗？后来如此，便对吗？能让经济敏感型用户用上便宜好用的电脑，这就是好的厂商——省去一切不必要的成本、去掉令人反感的溢价，让每个人都能享受到科技的乐趣。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7cf"
  },
  "id": "mechrevo-laptop-bidding-war",
  "title": "厉不厉害你机革？",
  "date": {
    "$date": "2023-02-15T00:00:00.000Z"
  },
  "category": "评论",
  "body": "2 月 14 日，当大伙还沉浸在舔狗节的恶臭气氛中时，机械革命突然向市场放出重磅炸弹：\r\n\r\n**RTX4060 游戏本只卖 5999。**\r\n\r\n消息一出，整个笔电行业为之震动。本来打算再收割一波人傻钱多二刺螈的预售天选 4 直接不敢放价格了，几个万元的 4060、4070 一线本也没了反应。想当初美帝良心想溢价者万元 3060，还有各种诸如泡水门的问题；曾经屠龙的社会主义普终成恶龙，牢牢把握价格不肯促销；打人硕趁机高价销售赛博答辩......\r\n\r\n几个国内外的一线厂“众志成城”，消费者根本没得选择，只能花高价买答辩回家恶心自己。再加上派特、老黄跟苏妈的“给力”——刀法日益精湛，“加量不加价”时代彻底结束。想要更好的性能就得花更多钱、耗更多电。\r\n\r\n而机革此举，就好比直接把狗奸商吃饭的桌子给掀了。你 i5 加 3050、1080P 屏幕卖七八千是吧，行，我十二代 i7 加 4060 卖 5999，屏幕直接来到 2.5K165Hz、100% sRGB。你有的，我都有，甚至比你好得多，就是跟你摆明了打价格战。\r\n\r\n机革放出消息没几十分钟，几千台笔电瞬间售罄。许多一线厂用户直呼亏本，紧接着某些品牌粉丝群出现舆论轰炸，我不说是哪个品牌。（画面一转）隔壁的神舟前几年干矿本生意挣了不少钱，当下正愁不知道怎么营销挽回声誉，看到机革出手，果断跟进：\r\n\r\n**5999 元，还带 DDR5。**\r\n\r\n是的，你没有听错。其实机革的内存是小有遗憾的，用的 D4-3200，而神舟再次扮演价格屠夫，不但核心配置上与机革 5999 元本一模一样，甚至内存小有升级，来到 D5-4800。但相应的，模具还是老一套蓝天 NH5X，导致只有一个 M.2 加一个 2.5'' 硬盘位。但！又耐不住 7 热管劲爆散热，这点就没什么好喷的了。\r\n\r\n至此，两家二线厂都已经下场血拼。而联想非常搞笑的在当晚发布了新品预告：13500H 加 4050 卖 8000，还得靠“Z 码”。这是什么？梁静茹给的勇气？凭此，我都不敢想象拯救者 23 版出来得多少钱。这种傲慢，以及对用户的轻视（无铅锡事件），终究会毁灭这个品牌。\r\n\r\n我相信市场会认可机革的这次爆破，就像十几年前的小米——让每个人都能享受科技的乐趣，让科技产品回归它本该有的价格。为表支持，我也购入了跟随者——神舟的战神 Z8D6（机革已经抢不到了），等到货了再来细细的说一说这货的“光辉历史”。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7d0"
  },
  "id": "20th-anniversary-prospect",
  "title": "二十周年前瞻：一体化规划",
  "date": {
    "$date": "2023-01-30T00:00:00.000Z"
  },
  "category": "随笔杂谈",
  "body": "学习和改变的逻辑层次最早是由人类学家格雷戈里·贝特森（Gregory Bateson，1904-1980）为行为科学的心理机制提出来的，是以伯特兰·罗素（Bertrand Russell，1872-1970）的逻辑和数学理论为基础。后由罗伯特·迪尔茨（Robert Dilts）从中提炼和发展出来，并在 1990 年开始介绍。\r\n\r\nBateson 确定了学习和改变的四个基本层次——每一个层次包含的元素都来自于它下面的层次，自下而上的每一个层次都会对个体、组织或系统产生更大的冲击力。\r\n\r\n对于 Bateson 来说，逻辑类型是“自然法则”，而并非简单的数学原理。他说：由一组细胞组成的肌肉和单个细胞属于不同的逻辑类型——大脑的特征和一个脑细胞也不是同一逻辑类型。这两者可以通过间接的回应相互影响——即：大脑的整体功能可以影响到一个单个脑细胞的行为，而一个单个脑细胞的活动也支持到了大脑的整体功能，事实上，可以这样理解：一个脑细胞通过和其他细胞组成的大脑来影响它自己。\r\n\r\n而逻辑层次是指个体或组织中各种活动所在不同层次之间的等级关系。每一层次的功能都是综合、组织和指导其下面层次的各种相互关系。高层次上发生的改变将必然向下“辐射”，从而在低层次上产生相应的改变。在低层次上发生的改变可能、但不一定能够影响到高层次。\r\n\r\n神经逻辑层次是由以下神经物理结构的“等级”构成：\r\n\r\n *  环境：神经末梢系统——感官和反射作用。\r\n *  行为：运动神经系统——有意识的行为。\r\n *  能力：大脑皮质系统——半意识化的行为（眼睛的活动，姿式等）。\r\n *  信念、价值观：边缘系统和自主神经系统——无意识的反应（如：控制心率，瞳孔变化等）。\r\n *  身份：免疫系统和内分泌系统——整个神经系统，深层生命维持功能。\r\n *  精神（系统）：是全方位的——每个个体的神经系统组合在一起，从而形成一个更大的系统。\r\n\r\n以上这六个层次实例化到人生规划中，被称为**NLP 模型**。即：\r\n\r\n *  主观的，对外界的认知，与自身发展无关。\r\n *  基本能力，一般先天注定或简单学习养成。\r\n *  高级能力，需要后天大量学习养成。\r\n *  指引自身发展的精神寄托，可以是社会规则、家族期望、个人理想等。\r\n *  了解最终自己在社会中的定位，并以此确定发展办法。\r\n *  了解自己发展对社会的终极价值，并以此确定发展办法。\r\n\r\n最垃圾的人，只会怨天尤人、抱怨周围的人不够好，这样的处在第一层（只能感知到环境）。通过行动试图改变现状的，处在第二层（有行动，但不多）。通过学习增进自身价值、改变现状的，处在第三层（提升自我）。知道自己在干什么，以及为什么干的，处在第四层（拥有短期目标，不至于无所事事浪费时间）。\r\n\r\n到这里，大部分人就可以停止了。因为大多数人都属于普通人，没有办法去思考定位和社会价值问题。比如说，古代的国王从一出生，就不用学习农活怎么干，而是学习驭人之术、驱使底层的人去干累活。相应的，现在高级家庭的孩子也不用像我们一样走寻常路、参与一些选拔人才的考试，因为他们一出生就是精英，我们永远无法与其竞争（很难竞争）。如果我们一出生就知道我们将来会是什么样的人，或者设定了较高的目标，那么人生轨迹自然是特别的。现在也不晚，只不过留给我们拐弯的幅度不多了。\r\n\r\n社会价值是什么呢？大多人的角色都算不上国家机器里的一颗小小螺丝——也就是可有可无。而能“为了中华之崛起而读书”的跟为了养家糊口读书的，将来的处境也绝对不一样。\r\n\r\n如果能完善前四层，那么人生路途应该是一帆风顺的。后两层需要根据自己的精神高度来决定，皮匠的孩子也有可能当上总统。且每层进步都受到上层的制约、受到底层的拖累，因此人在自我提升的时候，需要在每个层次上共同进步，否则很容易“眼高手低”或者“有能耐发挥不出来”。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7d1"
  },
  "id": "wandering-earth-review",
  "title": "流浪地球，中国科幻电影的里程碑",
  "date": {
    "$date": "2023-01-28T00:00:00.000Z"
  },
  "category": "评论",
  "body": "中国人能拍出好的科幻片吗？\r\n\r\n莫言让我们一睹红高粱中的民族豪情，于是我相信中国人懂战争片；薛晓路为我们讲述两个大城市的人能擦出怎样的火花，于是我相信中国人懂爱情片；开心麻花连续数年好作不断，于是我相信中国人懂喜剧片。\r\n\r\n但是我们大抵真的不懂科幻片。因为只有科幻片不取自于生活，它是完全虚构的。你没法像家庭伦理片那样从生活中取材换个名字就能糊弄观众，也不能像政治片那样随便吹捧就能骗到睿智资本的钱。改革开放以来，中国电影数量呈井喷式增多，主要还是爱情、战争片多，而科幻片一直都是一片空白。于是有一代人的童年，就是变形金刚、星球大战等欧美科幻快餐。我不否认，这些作品很经典、很优秀。但作为中国人，那时候的导演们还是想扬眉吐气，做一个中国的科幻大作，把文化入侵似的舶来品赶出去。\r\n\r\n但是很难。不光是剧本，还有海一样的特效。科幻片非常依赖特效，这个原因不必多说，你要创造出不存在的物品，当然得用一点科技。中国计算机水平起步晚，根本没法跟外国比，真硬上那就是特效尴尬的都能用脚趾扣出三室一厅。\r\n\r\n于是我们沉寂着，直到 2012 年，《冬眠》的出现，为国产科幻电影带来了一丝生机。该短片为我国培养了第一批现代高素质的特效制作团队和剧本编写团队，这也为之后《流浪地球》系列的出现奠定了基础（郭帆就在其中）。\r\n\r\n2019 年，《流浪地球》出世，它是完全国产化的，主要体现在技术人员配布上。该电影讲述了一个庞大的世界观，未来太阳不断膨胀即将吞噬地球，人类为了避免灭亡准备建造行星发动机，驱动地球逃离太阳系前往遥远的新星系，但在路过木星的时候遭遇了危机......《流浪地球 2》则是讲述还没“流浪”前发生的事情，算是倒叙。\r\n\r\n![](https://pic.imgdb.cn/item/64d1d4de1ddac507cc6b52d6.jpg)\r\n\r\n剧本是刘慈欣搞的，所以质量基本上没什么问题。要把情节、冲突拍出来，那就考验导演的功底了。如果科幻片一味堆砌特效，那就好比买蛋糕只吃奶油——腻歪。毕竟视觉效果再好，也只能做辅助。于是郭导选择塑造一个饱满立体、真实可信的形象：主角家庭残破，为生计被迫工作，最后为了拯救地球选择自我牺牲。看起来好老套，跟国外爽片一个味。但是不同就不同在，主角牺牲，是真的牺牲，一点不拖泥带水。国外搞的个人英雄主义，以及主角光环，我们一点不弄，而且主角还是中国人。在西方对我们的洗脑灌输中，中国人算什么东西？也能上太空、拯救世界？该片一出，立刻引来无数国人嘲讽。\r\n\r\n说实话，我觉得挺可悲的，很多人就像西方人、犹太人养的狗一样，就是相信自己是永远的奴才。为什么中国人不行？我就觉得行，我就觉得中国人是可以担起大任、拯救人类的。而且剧情确实是全程无尿点，没有令人感到假惺惺的地方。第二部更不用多说，驱动月球的场景和对 AI 的认知，那些伏笔埋得都相当漂亮。\r\n\r\n我为什么说这个系列很好，能算是科幻片的里程碑，首先，确实是认真拍了。有些人找鸭子拍烂片，恰饭圈的烂钱，或者借机洗钱，我不说是谁，懂的都懂。现在的国产影视行业，都什么现象？资方大把撒钱，根本不求打造艺术品，只想打造快消品，哪怕是一坨屎，也能包装成美味佳肴，送到那些心智不成熟的睿智观众嘴里，那些小肠长在小脑位置的憨子还连连说香，属实贻笑大方。而《流浪》系列，则确实算是十年磨一剑，精细打磨的良作，提振了我们民族自信心，也告诉世界，我们这块也不是吃素的。\r\n\r\n其次，以中式的特色手法拍摄。中国人很看重亲情和民族感情，这一块《流浪》算是下足功夫，在冷冰冰的科幻元素中加入归属感，确实能够彰显编导水平。想到一个切片，刘培强与 550W 对话时，机器不断刺激刘，最后刘崩溃大吼，躲在单面镜后的图恒宇陷入了沉思。其实图是被刘触动了，为了全人类、遵守规矩放弃亲情是否正确......当时看到这里的时候，我心里感到很复杂，确实是被触动了。不多说了，免得剧透。\r\n\r\n这电影我是大年初一刚上映就去看了，还是看的上午场。当时我那场里坐了大概三分之一的人，但还是能听到后面的观众时不时发出惊叹的声音，当然我自己也频频受到震撼。敢拍、能拍、认真拍，所以我说这是好电影。中国真的不需要更多像维密秀一样的圈钱烂片，而是需要《流浪》这样的良作，看看真正的艺术。从敢说，到不愿、不能说，又到现在的敢说、能说，中国电影探索了几十年。这漫长的奋斗，也是我们文化自信的开端。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7d2"
  },
  "id": "led-stroboflash",
  "title": "从买灯，到探究LED频闪问题",
  "date": {
    "$date": "2023-01-26T00:00:00.000Z"
  },
  "category": "技术参考",
  "body": "近几年关于屏幕，总是听到别人说什么“DC 调光”、“PWM 调光”之词，“没有 DC 调光的产品一律不买”之论调。这似乎是一种跟光源有关的参数，但是由于我当时还在上高中，没有什么动力去了解，所以这一块只是略微知道一些皮毛：DC 调光对眼睛好，PWM 调光对眼睛不好。且这种东西似乎离我太过遥远，没有必要去深究。\r\n\r\n直到前几天，我卧室的吸顶灯坏了。打开发黄的灯罩，里面是一块做工非常垃圾的 LED 灯板；驱动板整合了镇流器，也相当粗糙。灯点不亮，很显然，要么是灯珠的问题，要么是驱动板的问题，印刷电路板或者焊点我倒觉得不会出什么问题。仔细观察了一下走线，发现板子上总共两条干路（分别是高色温路和低色温路），每条路上串联 18 个单元，每个单元由两个相同规格的 LED 灯珠并联。由此，我提出了两种基于只有灯珠损坏的维修的设想：\r\n\r\n *  干路上有至少一个单元损毁，可能是灯珠内部已断路。用独立电源串联每个灯珠（正常的一般是 3V 即可点亮）可快速找到损坏件（正好用俩碱性电池串联当电源），购买同类灯珠替换即可。\r\n *  基于上一种思路，不替换灯珠而是直接对其短接。这个我已经上网求证，是可行的。\r\n\r\n考虑着维修事宜，我也在物色着新品。假设说，零买灯珠非常贵，那就不值得修；再退一步讲，这灯也用了好几年了，灯珠已经严重老化、暗的不行了，修好也是恶心自己，不如买新的。就在写文前几个小时，本来只有高色温路损毁的，其低色温路也坏掉了，这就完全不能用了。\r\n\r\n我又仔细回想了一下，几年来我一直默认开白光，所以白光先坏是可以接受的。但是黄光怎么会坏呢？白光坏了之后我开黄光，感觉流明数还是相当高的，说明灯珠寿命应该没啥问题。那这里很有可能就是驱动板出问题了，受频繁开关的影响，劣质镇流器里的变压线圈直接烧断了，导致两个灯带两端无电压。如果是这样，那就完全没有维修价值了，坏的部分太多了，应该预备报废。以后有兴趣拆灯珠出来焊点小东西玩得了。\r\n\r\n没办法，买个新的吧，先看台灯。不看不知道，一看没想到这小玩意那么多参数。从最基本的亮度和色温，到显色指数（接近自然光的指数，最大为 Ra100）和照明等级（光衰变和投影的综合水平，目前国标 AA 比较流行），给我看的眼花缭乱。最终，我选了欧普的一款百元级“护眼”台灯，米格M，反正就是宣称怎么怎么好，还支持米家接入（智能家具）。\r\n\r\n然后就是吸顶灯。不能说光照顾自己的临时需求，家里的东西坏了坐视不管啊。那么当然，还是搜的欧普，毕竟老牌照明厂商了，就算多花一点钱也无所谓。这里功率就比较重要了，因为吸顶灯默认是为照亮室内摆设而设计的，护眼变成了虚的东西，功率越高灯越亮嘛。但我发现，到了这里，事情反而变得复杂多了。12W 的米格 M 台灯卖 160 多，而欧普自家的 24W 吸顶灯才 19.9 元，还自带驱动板。明明 24W 更亮，灯珠数量也更多，为什么反而比台灯便宜那么多呢？\r\n\r\n这里引入一个概念，**调光**，驱动板调节发光的方式。高端的灯组不仅是灯珠封装耗费更高，其驱动板也是下了不少心血。传统驱动板是恒压方案，但劣质驱动板难以过滤杂波，因此灯珠两侧的电流在不断波动，这就使得 LED 必然在“亮”和“几乎灭”之间反复切换。当“几乎灭”的频率较高时，人眼能明显察觉这种闪烁，并产生严重错觉或不适。长期如此，会引发灾难性的后果。如果驱动板品质好（恒流、高频电子镇流），灯珠能够在一个较高的闪烁频率上运行，高于我国照明标准的 3120Hz，人就只会受到较小的影响。很显然，便宜的灯应该是在调光上缩水了。\r\n\r\n传统的恒压调光被称为 PWM 调光，特色是成本低廉；而高成本的恒流调光（CCR 调光 /DC 调光）直到现在也难以普及。我还记得去年我去一个朋友的奶奶的家里，其厨房用的是一个非常昏暗的 LED 灯，而且肉眼可识别频闪。老年人节俭惯了，灯不坏就不愿意换，尽管现有这个也是个劣质产品。这样下去，老人家的视力有可能逐渐恶化。\r\n\r\n这也是很多中国家庭的现状，东西不坏就不舍得换。在以前，受经济条件限制，可能确实不能考虑那么多。但现在，几乎家家都有不少存款，基本的吃穿不用再愁了，那么为了自己和家人的健康，我建议不要购买使用劣质低价灯具，且老化的灯源要积极更换。开头提到的屏幕也是如此，为了护眼考虑，最好选购 LCD 屏幕或带有全局 DC 调光的 LED 系屏幕。现在花钱是小事，以后就真不一定能花得起这钱了。\r\n\r\n早年流行的荧光灯，其拥有余晖效应，所以频闪几乎是难以观测到的。而 LED 则为了节能，舍弃了安全。再加上国内很多无良厂商为了降低成本，故意采用劣质原料，不但产品用不时间长，还对视力有不小的损害。希望业界中，优质的 MiniLED 和 MicroLED 照明产品能尽快普及，让“良币”驱逐“劣币”。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7d3"
  },
  "id": "2022-ending-summary",
  "title": "为了所热爱的一切",
  "date": {
    "$date": "2023-01-21T00:00:00.000Z"
  },
  "category": "主题长文章",
  "body": "有的人天生就是有很强的表达欲。我也有，但是我无法表达。\r\n\r\n这种信息，我不明白怎么告诉别人。要么就是别人听不懂，要么就是我说不清。我时常睁着眼幻想着这种抽象的信息结构，像摆弄积木的孩童般。但是这种“积木”，只有我才能“看见”。由此，我常与同龄人有很大的代沟。\r\n\r\n童年时期，由于严苛的家教，我基本上没有什么爱好。对于时兴的娱乐项目，几乎一无所知。我依稀记得，小学最后一年的某天，我碰巧与班长放学一起回家，他路过小卖部顺手买了个陀螺，我手里攥着硬币，却买了本漫画书。很显然，这两种物品没有什么联系。于是很快我就变成了一个人，走在路上。那时候，我发现我好孤独，明明大家都是相互认识的，明明我也有好好学习的，但是总是没法和大家玩到一起。\r\n\r\n又一次的，我爬上了高处，失望的眺望远处。那时候，小区里外总是有很多荒凉的高处，我没事的时候就喜欢逛逛这些不受人待见的地方。小时候的“孩子王”，现在被迫变成哑巴一样的人。这是如何的一种变化呢？我年龄太小，没法回答，只是继续眺望着，看着天色逐渐暗淡，等着晚上妈妈下班回来，好能开口讨一份温热气。\r\n\r\n后来我接触了批判主义、反叛主义，它们像磨刀石一样，无声打磨我的眼光和心。有了一眼看清人的资本，我才发现我其实是一个很能干事的人。渐渐的，我开始从自卑和闭塞中走出来，拥抱形形色色的人。但在多年的从商中，我也变成了曾经自己讨厌的样子：变得冷血、没有同情心；金钱亦麻痹了我的心灵，没人能劝服我。\r\n\r\n几年后，我遇到了一位挚友，他使我最终清醒过来。我开始思考金钱于我的意义，以及我人生的终极追求。在我早期的构想中，我想做一位对社会有用的人，通过实业或者先进技术，为普罗大众带来福祉，这是往大了说，算是达则兼济天下。要是“穷”了，那就好好独善其身，绝不求助于、拖累任何人。可我究竟是要做什么的一项事业的呢？我阅历太浅，没法回答，只是伏在课桌上，看着没过头的书本，等着高考后的那一天，好能真正为了自己所爱的而奋斗。\r\n\r\n2020 年，COVID-19 病毒席卷全球，封闭的政策使我意识到实体经济天生具有不可靠性。一旦遭遇天灾，基本上就要遭受毁灭性的打击。唯一好好生存下来的，只剩下公务员们，和一些特殊行业的人员。也因为此，我身边很多的人都选择了进军教育行业，打算入编捧铁饭碗。可是我却不敢苟同，因为我觉得当老师没法施展我的抱负。尽管这份工作也足够体面，绝对能“穷则独善其身”，但是很难“达则兼济天下”。我不希望我的人生还没泛起一丝波澜，就一眼望见了对岸。\r\n\r\n可我仍在摇摆着，直到在空军招飞中因过重而被淘汰。母亲说，当飞行员也是很好的。无论是进部队，还是进入民航公司，都很体面。钱，大把大把的拿；待遇，一辈子吃喝不愁。可是我已经不再对钱感兴趣，也不对所谓的“稳定”和“光鲜”有想法。这次失败，正好，奠定我极具冒险性的人生的开端。\r\n\r\n填报志愿时，我仔细端详着花名册上的院校和专业，父亲在一旁叽叽喳喳，我想办法平静下来自己，暗自捉摸着。最大的问题是我根本不知道我喜欢什么，虽然相对于其他人已经是瘸子里挑将军了。可是我还是拿不定主意，也不好掂量这一次抉择的厚重性。\r\n\r\n“他们都报的什么专业呢？”\r\n\r\n可是没有人会专门宣传自己的选择，我也不好意思去问。直到最后一次，我走进学校的机房，所有人都在紧张的填报着志愿，我才略知一二别人的方向。五花八门的，有语言、教育、经济、机械什么的，让人头晕眼花。坐下来，我面对着眼前这台电脑，我呆滞住了。回望这么多年以来，我不知道哪个爱好能成为将来吃饭的玩意。最终，我选择把赌注押在 CS（计算机科学）上。一个像我这样的人，刚认事家里的电脑就被送人，直到高中前还几乎对电脑一无所知；但又是一个像我这样的人，刚上高中就买了一台属于自己的笔记本电脑（用到现在），卖了那么多年的软件服务和硬件，真正做到了用爱好赚钱。\r\n\r\n于是我按下确定。\r\n\r\n在我的构想中，如果我顺利进入 CS 专业，那自然是万事大吉；如果被调剂，那我就要想办法转专业。为了防止转专业前浪费至少一整个学期，我所有槽位填的都是 CS 类的专业，清一色的，亮眼极了。\r\n\r\n最后不出所料，没有进入第一目标专业，进入了另一个相关的专业。但其前期课程和第一目标一样，转起来没有任何损失。平常在学校里，我努力学习专业课，希望尽快达成我的愿望——用独立项目为自己在市场上站稳脚跟打好基础。大一一整年，我的样子终于成为父母曾最爱的样子：老老实实的坐在那里，一学一整天。但是，我也因此失去了许多，至今我仍感到遗憾。\r\n\r\n可为了所热爱的一切，我甘愿放弃其他所有。国庆节的躁动，抚不动我的心；圣诞节的情热，拉不走我的心思；哪怕是春节的热闹，都不再与我有关。当我坐下思考的时候，我发觉灵感能像黄河一般汹涌，涌上我的指尖，驱动着它们在键盘上“啪嗒啪嗒”。有时候连续十几个小时的工作后，我会开心的跳起来，开心着又解决一个问题。从 CS 中，我真正发现了我的爱好。\r\n\r\n后来，随着技术不断长进，我感觉我距离愿望成真越来越近。学校里教的已经无法满足我的需求，我必须自主加修现在市场上流行的技术，以满足日益膨胀的表达欲。是的，这时我终于知道我的语言是什么语言：是能与机器“共鸣”的语言。很快的，我也达到了参与一些低级赛事的水平。但是我不想把时间浪费在沽名钓誉上，而是真正做一些有意义的实事。\r\n\r\n大家来学 CS，是为了什么呢？大部分无非是为了就业、为了赚钱。可我不在乎我以后的生活，我希望能用自己的力量推动社会进步。因为我一直认为此刻我是真正的共产主义斗士，我希望不为资本家服务、剥削劳动人民，而是使用技术造福人民，使普罗大众享受到科技带来的便利。我热爱它，我也能理解它，这时候我相信我有本事“达则兼济天下”——凭借着这股劲头。\r\n\r\n尽管我是备受争议的，是受尽嘲笑的，可我已经没有了顾虑的精力。我想用我的“笔”，写出我的想法，给到所有的人来看、来证明：人，从来就不必被打上“普通”、“平凡”的标签，纵使是“普通人”，也有义务和能力对社会作出贡献。\r\n\r\n身处寅虎年的最后一天，我满怀激情的写下本文。希望多年之后再回顾，那时我没有忘记我的本心、没有被生活打磨掉斗争的意志，仍是一个满腔热血的人。"
},
{
  "_id": {
    "$oid": "64ba7b8a56a52b86e967e7d4"
  },
  "id": "pb-ready",
  "title": "Penyo Blog 即将正式上线！",
  "date": {
    "$date": "2023-01-17T00:00:00.000Z"
  },
  "category": "随笔杂谈",
  "body": "Penyo Blog 将于 2023 年 1 月 17 日正式上线！这个项目从半年前悄然立项，到今年 1 月中旬初正式启动开发，中间对其定位和功能的打磨耗时不菲。我把这个博客定义为大号的“QQ 空间”，在这儿延续我真正的内在精神。\r\n\r\n我之前有个用了十年的 QQ 号，因为空间评论了腾讯的美国爹，号被永久封禁。我说实话，我很无语。因为我说的都是事实，对于每一个中国人来说也几乎都是能理解认可的。但是这种内容就是所谓的“敏感”。甭管你对不对，反正就是不能讨论。这就是国内的舆论环境：想涉政，你必须吹捧执政党，至于其他的，你得看上面的脸色。因此说，中国人是没有所谓的言论自由的，这一点，我相信谁都不能否认。\r\n\r\n所以，我很高兴我建立起来了属于自己的博客。这一刻，我终于不需要再看任何人的脸色，也不用再关心会不会因为语言太尖锐而被恶意举报，然后被中专审核删掉。这世界上那么多人，我没有耐心和怜悯心去了解他们那无所谓的搞笑感受。我只想看到真相、说出真相、挥剑斩向黑暗。当然，对于博客，我也能料想到一种结局。有的人，他天生就是汉奸。他不能容忍你针砭时弊，于是使出各种各样的阴招，向有关部门举报算轻的了，重的直接网上开喷、报警。那么对于这种人，我只能说，你要是真的爱国者，你就要有为了更光明的未来的中国而能付出一切的决心，如果你想成为却没有勇气成为，请不要嘲讽那些仍在努力的人，哪怕是微不足道的。\r\n\r\n虽然在这里没有谁来监管，我也不至于过于放纵。因为我知道作为一个人、一个中国人该有什么立场，那当然是客观看待事物、勇敢揭开伤疤，让国家变得更好。其次，我在博客上，也不至于总发评论，还有很多生活中的、专业中的、文学中的事情，等待我去探索。因为我首先是一个百姓，其次才是一个“记者”。\r\n\r\n人，为什么具有差异性？不仅仅是外表不一样，更重要的是内在，是思考。一个没有思考的人，一个随大流的人，他是不会有很大的成就的。跳出圈套、打破规矩，才是我们应有的态度。\r\n\r\n技术方面，网站的传统三件套全部独立编写，真正做到对代码结构了如指掌，便于随时调整。服务器和域名什么的，都不用我操心，这免去了麻烦的国内监管。以后技术更好了、经济条件更宽裕了，我会乖乖租个域名和独立服务器的。现在没那么多条件，自然也就整不了太多花活。能搞了，第一时间当然是做出来评论、站内信、用户系统等功能，敬请期待。"
}]